[{"id":1,"title":"Getting Started: Organization, Managing Recipes, Mise en Place, Hygiene","description":"Success in the kitchen begins with organization. Keep your ingredients in front of you, and make sure all of your equipment is nearby and in good working order. ‰Û¬‰Û¬You may have the luxury of designing your kitchen from the ground-up, but if not, there are things you can do to rearrange how you operate in the one you have. Make sure you have easy access from your main station to the stove, the sink, the fridge and the pantry. Also, use the concept of mise en place - that's French for \"setting in place.\" This is the practice of having your ingredients measured and set before you in an organized way. Lastly, make sure you read the recipe - top to bottom - before you begin.","video_length":286,"videoname":"v002","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id001"},{"id":2,"title":"Kitchen Set-Up - Pantry Organization","description":"A well stocked kitchen will give you greater flexibility as you cook. There are staples that every pantry should have, including kosher salt, black pepper (in a mill), extra-virgin olive oil, vinegar (red and/or white and/or balsamic), flour, sugar (white and brown), baking powder, boxed chicken broth, canned tomatoes, rice, various pastas, dried and canned beans, canned tuna, olives, tuna, nuts, chocolate, ketchup, soy sauce, and spices such as cumin, cayenne, fennel seeds, curry powder, cinnamon, oregano, nutmeg, white pepper, bay leaves, onion powder, garlic powder and red pepper flakes. ‰Û¬‰Û¬Organize your pantry with the most-used items on easy-to-reach shelves. Store heavy items on the bottom - but off the floor - and use airtight containers for bulk items. Finally, label all items to be sure you're always using something fresh.","video_length":278,"videoname":"v003","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id002"},{"id":3,"title":"Kitchen Set-Up - Fridge & Freezer Organization","description":"Keeping basic staples in your refrigerator and freezer helps you cook with ease and convenience. In your refrigerator, stock basics like milk, butter, eggs, cheese, fresh vegetables (onions, potatoes, garlic), fresh fruit, various meats (chicken breast, sausage, steaks) and mayonnaise. You'll also want to keep other items handy, such as jams, pickles, yeast, yogurt, heavy whipping cream, sour cream and buttermilk. Keep your fridge at 40 degrees Fahrenheit. Label items for freshness and label foods as you open them. Also, keep raw foods separate from cooked foods and regularly wipe down the shelves and interior walls of the appliance. ‰Û¬‰Û¬In the freezer, keep staples such as chicken breast, ground beef, steaks, lamb chops, frozen mixed veggies (like peas and pearl onions, sweet corn or spinach), a baguette, stocks in ice cube form and a high-quality vanilla ice cream. Keep your freezer at 0 F or colder, freeze only foods that thaw well, and be sure to label all foods. Finally, keep in mind that thawing should always be done under refrigeration or cool running water - this keeps the food at a safe temperature.","video_length":286,"videoname":"v004","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id003"},{"id":4,"title":"Introduction to Knives","description":"Knives are a chef's best friend. The chef's knife is your most important cutting instrument - 8-10 inches long and great for slicing, mincing and chopping anything. Your paring knife is a smaller tool best used for coring, peeling and trimming. The Santoku is like a chef's knife only shorter - and with a scalloped edge that's great for slicing veggies. Other options include a bread knife, a boning knife and a good filleting knife. ‰Û¬‰Û¬After each use, run your knife along the honing steel a few times. Periodically, sharpen your knives on a whetstone - just follow the manufacturer's instructions, then run the edge of the blade along it at a 20-degree angle from tip to heel. Repeat about 10 times on each side. Wipe the blade down and you're finished. Choose knives that feel comfortable to you. There are also many different materials to choose from - each has its own characteristics, so do some research and see what most fits your cooking needs.","video_length":346,"videoname":"v005","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id004"},{"id":5,"title":"Cookware - Pots & Pans 101","description":"There's a world of cookware out there, but there's no need to purchase it all. One essential is a large sautÌ© pan. Sauce pans are also useful - look for pots with thicker walls for even heating. You'll also need one large stock pot. Additionally, a good non-stick sautÌ© pan is also critical. ‰Û¬‰Û¬A turkey roaster - or large roasting pan - is another kitchen essential. Look for one with a rack. Other options include a Dutch oven for long braising or stews, a cast-iron griddle pan for searing, and a wok.","video_length":254,"videoname":"v006","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id005"},{"id":6,"title":"Kitchen set-up - Tools & Gadgets","description":"Of the many kitchen gadgets on the market, here are your essentials: a cutting board (choose plastic or wooden, just use a separate one for raw meet and seafood versus cooked food and veggies), large metal spoons, wooden spoons, tongs, rubber and slotted spatulas, ladles, a spider (a strainer for fried foods or poaching), a vegetable peeler (also good for shaving parmesan cheese or chocolate), potato masher, box grater, sieves and a balloon whisk (used for whipping cream or making vinaigrettes). ‰Û¬‰Û¬For more specific tools, consider a mandolin (for thinly slicing ingredients into paper-like sheets), a microplane (another great tool for fine finishes) and a potato ricer (the secret to getting super-smooth, restaurant-quality mashed potatoes).","video_length":314,"videoname":"v007","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id006"},{"id":7,"title":"Kitchen Equipment & Small Appliances","description":"Here's the basic equipment you need to cook like a Top Chef. ‰Û¬‰Û¬First, the range. Available in gas, electric and induction, each has its own pros and cons. Gas provides natural fast heat and precise control. Electric ranges are common to most home kitchens. And induction ranges are high-tech options that use electro-magnetic energy to heat up the surface of the pot or pan instead of the surface of the range itself - this results in energy efficiency and speedy heat. ‰Û¬‰Û¬Second, the oven: most kitchens feature a convection oven instead of a conventional one. ‰Û¬‰Û¬Third, the microwave: essential for quick and thorough heating and re-heating. ‰Û¬‰Û¬Beyond big appliances, you should also have a food processor, a blender and possibly an immersion blender. Finally, a bench-top mixer will enable you to whip egg whites, make cakes, knead dough, and even roll out pasta or make sausage.","video_length":212,"videoname":"v008","techniques":"basics","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id007"},{"id":8,"title":"Introduction to Knife Skills","description":"Good knife skills take practice. Start with these basics. ‰Û¬‰Û¬Hold the handle with you hand close to the heel of the blade and gently grasp with your thumb and the inside of your index finger. Use a fluid motion when cutting, rocking back and forth with the knife's natural curve. Use your free hand to guide, but keep your thumb and your knuckles tucked back to avoid accidents. ‰Û¬‰Û¬Common cuts include slices, matchsticks, cubing and planks. A \"chiffonade\" is any thinly-sliced ribbon of leafy greens or herbs. Stack or roll the leaves then slide the knife gently through to achieve this effect.","video_length":230,"videoname":"v009","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id008"},{"id":9,"title":"Working with Onion & Garlic","description":"To break up a garlic bulb, place the head upside-down on your cutting board, then push down with the palm of your hand. Peel the clove by laying it on the board and gently mashing it with the flat of your knife blade, loosening the paper. Run your knife through for slices, or mince it by smashing it flatter during the peeling stage until it disintegrates then slice the resulting pulp. For paste, add a sprinkle of kosher salt to minced garlic and smear the combination with the flat of your blade. ‰Û¬‰Û¬To roast garlic, cut off the top of the head, then place in tightly-sealed and oiled foil pouch and roast in the oven for 30-35 minutes. When done, remove from pouch and squeeze out the pulp. ‰Û¬‰Û¬To peel an onion, make a shallow slice from tip to root, then remove the outer layer and discard. Slice lengthwise for crescents or cross-wise for rings. To dice, half the onion and place flat on the board. Make horizontal cuts through the onion to the root - but not all the way (you want it to stay together). Now run the knife through, turning your matchsticks into a dice.","video_length":453,"videoname":"v010","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id009"},{"id":10,"title":"Mire Poix - Carrots, Onion and Celery","description":"Mire poix is the cornerstone of stocks and soups. Principally, it uses onions, carrots and celery. Use two parts onion to one part carrot and celery - cut into any evenly-sized shape. ‰Û¬‰Û¬Rinse all ingredients thoroughly. Trim and peel onions, and trim off both ends of the carrot and peel. Celery should be trimmed at tip and root as well. Place ingredients in a pan with butter and cook until translucent. ‰Û¬‰Û¬You can also substitute onion, celery and carrots for other ingredients - like mushrooms, garlic, leeks, fennel, parsnips, shallots, chilies or tomatoes. Just make sure to stick to a loose 2:1:1 ratio. Variations will give you a white mire poix, a brown mire poix, or a Cajun miro poix.","video_length":382,"videoname":"v011","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id010"},{"id":11,"title":"Specialty Vegetables I - Leeks, Peppers and Mushrooms","description":"Learn how to professionally clean and prepare these ingredients that require specific techniques to yield the best results.","video_length":349,"videoname":"v012","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id011"},{"id":12,"title":"Specialty Vegetables II - Tomatoes 101","description":"Learn how to clean and prepare tomatoes like the professionals‰Û? including peeling them!","video_length":365,"videoname":"v013","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id012"},{"id":13,"title":"Specialty Vegetables III - Potatoes and Artichokes","description":"Learn how to professionally clean and prepare these ingredients that require specific techniques to yield the best results.","video_length":357,"videoname":"v014","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id013"},{"id":14,"title":"Lettuce Principles 101","description":"There are four basic types of lettuce: Crisphead, Butterhead, Looseleaf and Romaine (or Cos). ‰Û¬‰Û¬Iceberg is the most common Crisphead. Look for a tightly formed head and few brown leaves. Common Butterheads include Bibb and Boston lettuce. Look for a tightly-held head at the root end and crisp, light green leaves with few blemishes. Looseleaf comprises a wide family of lettuces that can come in any shade (from red to dark green) - these lettuces have delicate leaves, so look for specimens that are firm and fresh. Finally, Romaine lettuce: longer in shape, the ideal head will have nice dark green outer leaves held tightly together at the root. ‰Û¬‰Û¬To clean lettuce, submerge in a large bowl of cold water and let sit for a few minutes. Gently lift out and either layer the leaves with towels or use a salad spinner. To store cleaned lettuce, wrap in towels, place in an airtight container and promptly refrigerate.","video_length":417,"videoname":"v015","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id014"},{"id":15,"title":"All About Herbs","description":"There are two primary classes of herbs: tender and robust. Tender herbs include Chives, Cilantro, Dill, Mint, Parsley and Tarragon. Robust herbs include Bay leaves, Marjoram, Oregano, Rosemary, Sage and Thyme. ‰Û¬‰Û¬Herbs such as Rosemary can be used whole - just be sure to always remove the woody parts. To chop herbs, roll them into a tight \"cigar\" formation, press the tip of your knife into the cutting board, then push the herbs underneath as you rock the blade. For a bouquet-garni, simply tie some herbs together with kitchen twine and drop into soup or broth. Use a piece of cheesecloth as an alternative. ‰Û¬‰Û¬Fresh herbs can be stored in a resealable plastic bag for up to a week, or in a bowl of water (like fresh flowers).","video_length":530,"videoname":"v016","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id015"},{"id":16,"title":"Introduction to Spices","description":"The spices most commonly used in the kitchen include salt (in the form of course, full-flavored Kosher, Fleur de Sel, Maldon or common table salt), pepper (black peppercorns in a grinder), Paprika (dried red pepper), Coriander (cilantro seeds), Cardamom, Saffron (the most expensive spice), Star Anise (with a strong licorice flavor), Cloves (dried myrtle-flower buds), Cinnamon (dried bark), Ginger (a sweet/spicy root), Nutmeg (a large seed that is usually ground), and Fennel (another licorice flavor). ‰Û¬‰Û¬To ready spices for use, place a pan or skillet over medium heat. Spread the spices evenly then shake the pan constantly to prevent burning. Cook until you can smell the strong bouquet. To grind them, place the spice in a mortar bowl and grind with a pestle. You can also use a coffee grinder - just be sure to use a separate one than you use for your actual coffee.","video_length":429,"videoname":"v017","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id016"},{"id":17,"title":"Working with Citrus","description":"There are three principal ways to work with citrus: zesting, segmenting and reaming. ‰Û¬‰Û¬Always start by washing the citrus thoroughly to remove the wax applied for protection. To get the zest off of a lemon - that's the colorful outer part of the peel outside of the bitter white pith - it's best to use a rasp-style grater. ‰Û¬‰Û¬Segmenting is typically done with sweeter citrus, like orange. Slice off the top and bottom and expose the flesh. Stand the fruit on one end, then peel off the rind and pith, cutting along the contour of the fruit. Hold over a bowl and use a paring knife to cut between segments. ‰Û¬‰Û¬To juice a citrus - like a lime - roll it on a countertop then cut in half crossways. Insert a reamer or the tines of a fork into the center of the fruit, hold over a bowl with a sieve on top, then twist.","video_length":538,"videoname":"v018","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id017"},{"id":18,"title":"Specialty Fruits I - Berries, Stone Fruit and Watermelon","description":"Learn how to professionally clean and prepare these ingredients that require specific techniques to yield the best results.","video_length":438,"videoname":"v019","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id018"},{"id":19,"title":"Specialty Fruits II - Pineapple, Mango, Avocado, and Coconut","description":"Learn how to professionally clean and prepare these ingredients that require specific techniques to yield the best results. We'll even show you how to open a fresh coconut.","video_length":553,"videoname":"v020","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":1,"chef_id":6,"iap_id":"com.topchefu.iap.lesson.id019"},{"id":20,"title":"How to Make a Basic Stock","description":"Here's how to make a basic stock: Start with your basic mire poix, add garlic, any kind of bones (chicken, pork, fish, beef, veal, lamb), cold water, black peppercorns and the bouquet garni of your choice (that's a bundle of herbs tied together with kitchen twine or wrapped in cheesecloth). ‰Û¬‰Û¬Sweat the veggies in a large pot and cover. When translucent, add bones (trimmed of excess fat). For a darker stock, roast the veggies and bones on a sheet pan in the oven before adding to the stock pot. ‰Û¬‰Û¬Put the bones and veggies in a pot and cover with cold water (not warm or hot - this will ruin your stock). There should be about 2 inches of water above the level of the ingredients. The higher the ratio of solids to liquid, the more flavorful the stock. Add the bouquet garni and peppercorns, then heat on high until it boils. Reduce heat to a simmer. ‰Û¬‰Û¬Chicken stocks cook about 3.5 hours. Veggie stocks cook about 45 minutes. For veal, beef, pork or lamb, cook 6 to 8 hours. Skim fat off the top periodically. Taste and season accordingly and strain into an appropriate container.","video_length":768,"videoname":"v021","techniques":"roast, boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id020"},{"id":21,"title":"Different Types of Stocks","description":"For a fish stock, or fumet, start by soaking white-fleshed fish bones in ice water. Then sweat onions and fennel in a pan with butter. Add some white wine, followed by the fish bones. Be careful not to brown. Simmer for 30 minutes. ‰Û¬‰Û¬For a roasted stock, toss bones in olive oils and a little tomato paste and place on a sheet pan in the oven. Stir occasionally. Cook for 30 minutes at 400 degrees Fahrenheit. Put in a pot with cold water, careful to deglaze to get all the flavor left on the pan into the pot. Scrape the bottom of the pan to get additional flavors as well. From here, simmer and prepare like a basic stock.","video_length":709,"videoname":"v022","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id021"},{"id":22,"title":"Beyond Stocks - Products & Terms","description":"Sometimes, you just don't have time to make a stock from scratch. In those instances, here's what you can do. ‰Û¬‰Û¬Bouillon cubes are a good option - just dissolve in hot water. They tend to be salty, so season carefully. Organic stocks and low-sodium stocks also work well. ‰Û¬‰Û¬Stocks tend to be richer, thicker, and deeper in flavor because they're made from bones. Broths are lighter in flavor and color because they're made from meat. ‰Û¬‰Û¬Here are some terms you may need to know as well: \"Consomme\" is a meat or fish broth that has been clarified with a \"raft\" of ground meat, fish, veggies or egg whites that catches the impurities and is then discarded. A \"demi-glace\" is a roasted stock (usually veal) reduced by half. And \"jus\" is simply the pan juices from cooked meat.","video_length":227,"videoname":"v023","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id022"},{"id":23,"title":"Clear Soup: Chicken Noodle","description":"Soup is all about building flavors the right way. Chicken noodle soup is a great example - with olive oil, onions, garlic, salt and pepper, you build a savory flavor base. White wine adds additional body, and either dark or white chicken meat will affect the flavor, too. ‰Û¬‰Û¬Carefully time the addition of each ingredient - veggies, noodles and chicken - to bring out the best of all of your textures and flavors.","video_length":605,"videoname":"v024","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id023"},{"id":24,"title":"Cream-Based Soup: Potato-Leek","description":"Like clear soups, creamy soups are best made by building flavors. Remember to keep your ingredients clean - that means thorough rinsing and washing of all veggies. ‰Û¬‰Û¬One other hint: Remember that you can always add more liquid, but you can't take it away. With that in mind, be careful when adding liquid ingredients. With our potato leek example, you'll also want to keep in mind that potatoes absorb salt, so be cautioned against allowing the soup to become bland.","video_length":934,"videoname":"v025","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id024"},{"id":25,"title":"Pureed Soup: Roasted Tomato","description":"Pureed soups are classically delicious. Like any soup, you'll build flavors with roasted vegetables - just remember, there's no reason to cut these veggies perfectly. It's all going to get pureed. ‰Û¬‰Û¬A few additional hints: the key to a good puree is smoothness, so don't hesitate to strain the mixture if you need to. And when you add your cream, don't over-do it - otherwise the soup will become pasty.","video_length":731,"videoname":"v026","techniques":"roast, boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id025"},{"id":26,"title":"Chilled Soup: Spicy Gazpacho","description":"Gazpacho is a classic hot-weather appetizer. Just chop and blend your veggies, soak some bread in tomato juice, add vinegar to your veggies, then put it all together in the blender. Season accordingly and puree until smooth. ‰Û¬‰Û¬For chunky style, just chop your veggies evenly and skip the puree. Add watermelon for a surprising twist.","video_length":532,"videoname":"v027","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":2,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id026"},{"id":27,"title":"Introduction to Vinaigrettes","description":"Classic vinaigrettes are made from a simple 3 to 1 ratio of oil to vinegar. You can make them by hand or in a blender - the latter saves you time, energy, and yields a more perfectly emulsified dressing. ‰Û¬‰Û¬Experiment with different chopped herbs to enhance flavor. You can also add may for a creamier dressing -- perfect for potato salad or coleslaw.","video_length":853,"videoname":"v028","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id027"},{"id":28,"title":"Homemade Mayonnaise & Dressings","description":"Mayo is the building block of many creamy dressings. By simply blending ingredients and seasoning, you're on your way to a great dressing or dip. For a classic Caesar dressing, you'll add anchovies, parmesan and Worcestershire (and you'll like the anchovies more than you think). Simple herbs added to the mayo creates an inventive spread. ‰Û¬‰Û¬Remember, you can always thin your mayo with water or lemon juice.","video_length":939,"videoname":"v029","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id028"},{"id":29,"title":"Raw Sauce - Chimichurri with Seared Strip Steak","description":"Sauces round out the flavor of grilled and roasted meats, fish and vegetables. One interesting example is chimichurri - an herb-based sauce from Argentina that's great with grilled meats. You can make a smooth or chunky version, depending on what textures appeal to you. ‰Û¬‰Û¬Salsa verde is similar to chimichurri - just take out the chili flakes and oregano and add in tarragon, chives, chervil, capers and shallots. As a final example, consider gremolata - an Italian condiment most often found with the classic dish Osso Bucco. ‰Û¬‰Û¬You can be prepared to make any of these sauces just by keeping a few simple herbs and a head of garlic on-hand at all times.","video_length":614,"videoname":"v030","techniques":"raw","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id029"},{"id":30,"title":"Introduction to Marinades - Asian Beef Marinade","description":"Marinades not only flavor meat, they also tenderize it. This is the best way to prepare meat before grilling. ‰Û¬‰Û¬Some basic ingredients are required of all marinades - most notably, salt (which can take the form of Soy sauce) and an acid (either as vinegar, citrus, or dairy products like yogurt or buttermilk). Salt flavors the meat and acid tenderizes it. ‰Û¬‰Û¬When marinating, refrigerate the meat and make sure it's completely covered in the marinade - either by submerging it or turning it regularly. ‰Û¬‰Û¬Choose the marinade to match the meat: lemon/rosemary flavors for chicken, oregano/cumin/parsley/yogurt for lamb, and soy sauce/citrus/vinegar for beef. ‰Û¬‰Û¬These are just basic combinations - enhance them further with our recipes or your own.","video_length":1069,"videoname":"v031","techniques":"","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id030"},{"id":31,"title":"Pan Sauces 101 - Three Cooked, Pan-Sauces","description":"Pan sauces are exactly that - sauces based on the bits of flavor left in the bottom of the pan. ‰Û¬‰Û¬Pork dishes are best complemented with mustard-based sauces. For steak, a red-wine and peppercorn sauce works well. And buerre blanc, or butter sauce, is ideal for fish or seafood.","video_length":1157,"videoname":"v032","techniques":"sauce","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id031"},{"id":32,"title":"The 5 Mother Sauces","description":"There are five mother sauces that are the foundation of French cooking: ‰Û¬‰Û¬BÌ©chamel - a white sauce that begins with a light roux of flour and butter and enhanced with milk or cream and light seasonings. ‰Û¬‰Û¬Veloute - a stock-based white sauce that combines a roux with veal or chicken stock. ‰Û¬‰Û¬Espagnole - a roasted veal stock thickened with roux and combined with tomato paste and mushrooms. ‰Û¬‰Û¬Hollandaise - a truly difficult sauce, it is made by whisking egg yolks over a water bath then adding clarified butter and lemon. ‰Û¬‰Û¬Tomato - a basic tomato stock that begins with miro poix combined with tomatoes, tomato paste, flour and a little sugar and water or stock and then seasoned with a bouquet garni.","video_length":1745,"videoname":"v033","techniques":"sauce","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id032"},{"id":33,"title":"Pureed Sauces - Chicken Mole","description":"Pureed sauces are slightly more complex than basic ones. One example is Mexican Mole - a classic combination of chilies and chocolate. All sauces hinge on balancing flavors to build complexity, and this one is no different. ‰Û¬‰Û¬A few hints: Remember to soak chilies well - preferable overnight. Use dark meat for braising because white meat becomes too tough. Save your soaking liquid in case you need to thin your mole later. And don't forget - no need to toast ground spices because they'll probably burn","video_length":932,"videoname":"v034","techniques":"sauce","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id033"},{"id":34,"title":"Raw - Crudite Platter, Hummus, Bagna Cauda","description":"\"Crudite\" is simply a seasonal veggie plate with dip. ‰Û¬‰Û¬One classic dip choice is \"bagna cauda\" - an Italian dish served warm and infused with the flavor of chilies. Another simple option: hummus - simply blend canned chickpeas with spices and olive oil.","video_length":627,"videoname":"v035","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id034"},{"id":35,"title":"Composed Salad - Salad Nicoise","description":"Salad Nicoise is the most notable example of the composed salad - that is, a salad where the ingredients are artfully arranged instead of simply tossed together. ‰Û¬‰Û¬For your Nicoise, you'll use eggs, green beans, tuna and red onions - finished with a light vinaigrette. ‰Û¬‰Û¬The green beans should be blanched until tender. Afterward, add them to an ice bath - and don't forget to salt it to preserve flavor. Additionally, sear your tuna for added drama. Slice onions thin and cut eggs in rounds or wedges. Arrange perfectly and you're finished.","video_length":1354,"videoname":"v036","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id035"},{"id":36,"title":"Chopped Salad - Classic Cobb","description":"The Cobb Salad is the most famous of the chopped salads. Use the knife skills you've practiced - they'll save you time and help create a salad with the perfect-sized ingredients. ‰Û¬‰Û¬Use romaine and watercress for crunch and spice. The combination of salty bacon, tangy cheese and rich eggs creates the perfect complement of flavors. Use these same principles - complementary flavors and evenly-chopped ingredients - to create other great variations, like a Greek salad. ‰Û¬‰Û¬Final note: you're always moments away from a great chopped salad when you keep your fridge stocked with fresh veggies and good cheeses.","video_length":721,"videoname":"v037","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id036"},{"id":37,"title":"Tossed Salad - Caesars Salad","description":"Contrary to popular belief, Caesar salad isn't named for Julius Caesar. It's named after its inventor - Mexican chef Caesar Cardini. ‰Û¬‰Û¬This one is simple, elegant, and all about the dressing. Use a blender - it'll cut your prep time in half. ‰Û¬‰Û¬As for lettuce, we recommend romaine - it's strong enough to hold up under such a hearty dressing. And as always, remember to add the dressing with care. You can always add, but you can't take it away.","video_length":858,"videoname":"v038","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id037"},{"id":38,"title":"Salads - Classic French - Frisee Aux Lardon","description":"Though this salad is simple, its success depends on the perfection of your technique. ‰Û¬‰Û¬Try using slab bacon instead of pre-sliced - it gives you greater control of your recipe. These are your \"lardons\" crispy slices to complement the fresh frisee lettuce. ‰Û¬‰Û¬Some tips on poaching eggs: Simmer the water, don't boil it. Add the eggs, and let simmer until the egg sets but the yolk is still runny. This can be a little trickier than it sounds; we'll devote an entire segment to it later. ‰Û¬‰Û¬Assemble the salad, add croutons and you're done.","video_length":696,"videoname":"v039","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id038"},{"id":39,"title":"Salads - Sans Lettuce - Spicy Southwest Salad","description":"Some salads don't include any lettuce at all. One example: southwest salad. It includes corn, chicken, hearts of palm, avocado and beans. Acidity in the salad will keep the avocado from turning brown. ‰Û¬‰Û¬This salad features a combination of pureed ingredients, chopped fresh elements and sliced chicken breast for a unique trio of texture, temperature and flavor.","video_length":1225,"videoname":"v040","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id039"},{"id":40,"title":"Coleslaw Basics - Creamy vs Vinaigrette","description":"Coleslaw can be made with red or green cabbage - with mayonnaise-based or a vinegar-based dressing. ‰Û¬‰Û¬Traditional mayo-based slaw is the perfect accompaniment to BBQ or hot dogs. The lighter alternative is a fresh new interpretation that's great with seafood, and includes chives, parsley and apple. Just remember to add the apples last so they don't turn brown. ‰Û¬‰Û¬Always use fresh cabbage for the classic coleslaw crunch. And no matter which version you make, always refrigerate well before serving.","video_length":1002,"videoname":"v041","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id040"},{"id":41,"title":"A Lighter Dressing: Carrot-Ginger Dressing","description":"Dressings don't have to be fatty to be flavorful. Here we make a carrot ginger vinaigrette that's loaded with flavors, not calories. ‰Û¬‰Û¬It's a delicate balance of sweetness (carrot and ginger) and saltiness (soy sauce). Rice vinegar gives it a tang and tofu brings a creamy texture. The sesame oil rounds out the flavor with nutty fullness. ‰Û¬‰Û¬Remember to add the oil slowly so that it emulsifies. And in all your dressings, try using buttermilk or low fat yogurt instead of mayo, sour cream or heavy cream. You can also plus the health of your salad by avoiding cheese, bread and bacon and opting for salads with grains, nuts and seeds. Final tip: dressing on the side gives you a healthy amount of calorie control, too.","video_length":533,"videoname":"v042","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":3,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id041"},{"id":42,"title":"Principles of SautÌ©ing","description":"SautÌ©ing is a quick way of pan-cooking food to maximize moisture in the food - and creating a golden outer crust. The secret? Cooking at medium-high heat with a little bit of oil. ‰Û¬‰Û¬A cast iron skillet is ideal - better than lighter pans. It should be shallow and wide. Use clarified butter instead of oil if you like, or a combination of both butter and oil. ‰Û¬‰Û¬The meat you use should not be too thick and of uniform thickness. Always use tender cuts. Make sure the meat is dry. Place in the pan when the butter sizzles. For chicken, leave in place - without moving - 2-3 minutes. Then turn it, being careful not to splatter on yourself. Deglaze the pan when you're finished for a delicious sauce.","video_length":468,"videoname":"v043","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id042"},{"id":43,"title":"SautÌ©ing Veggies","description":"The key to successful sautÌ©ed vegetables is a very high heat. Use a wok or a large skillet (preferable cast iron). Keep the pan hot - at medium-high heat - to avoid sticking. Use just a little bit of virgin olive oil, and above all else, be mindful of the different cooking times required by different vegetables. ‰Û¬‰Û¬Begin with the vegetables that take the longest to cook first. And if you're throwing in root vegetables like potatoes, make sure they're cut into small pieces so they cook more efficiently. ‰Û¬‰Û¬Wash your vegetables, but be sure they're dry before placing them in the pot. Water is the enemy of cooking oil. Cook until lightly browned on the outside - you don't want to wilt the vegetables. Finally, remember not to over-fill the pan...this will reduce the heat and cause the food to steam instead of sear.","video_length":942,"videoname":"v044","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id043"},{"id":44,"title":"SautÌ©ing Meat - Bone-in vs Boneless","description":"SautÌ©ing meat is quick, easy and delicious - it effectively locks in both moisture and flavor. You can use any type of sautÌ© pan, such as the sautoir (with straight sides) or the sauteuse (with sloping sides). Heavy gauged stainless steel with a layer of aluminum in the middle is best. ‰Û¬‰Û¬For red meat, use only tender cuts like a filet mignon or strip steak, not tougher cuts like a shank or brisket. For tender steaks more than an inch thick, start them in the pan and finish them in the oven. ‰Û¬‰Û¬For the perfect rib eye, get a bone-in variety for more flavor. Season simply with salt and pepper. Heat the pan on medium-high heat (you want it really hot) and add some butter. When it sizzles, throw in the steak - just make sure it's dry. Don't move it around a lot - and remember, to really lock in the moisture, you'll only want to flip it once.","video_length":615,"videoname":"v045","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id044"},{"id":45,"title":"Principles of Boiling - Shrimp Boil","description":"Boiling is strictly defined as cooking food by complete immersion in water or stock heated at 100 degrees Celsius. Remember these basics: ‰Û¬‰Û¬Root veggies should be started in cold water to filter out bitterness. Cover with a lid, turn up the heat and add salt once they're at a boil. ‰Û¬‰Û¬Start green and leafy veggies in water that's already salted and boiling. Once they're added, cover with a lid until boiling again, then remove it. ‰Û¬‰Û¬Remove any material that rises to the top by skimming it away. Replace lost water to keep your food from drying out. And when finished, drain cooking water immediately and rinse the food with cold water. ‰Û¬‰Û¬To simmer, keep the temperature at 95-99 degrees Celsius. Look for gentle currents or small bubbles just breaking the surface. ‰Û¬‰Û¬For the perfect hardboiled egg, place in cold water with one inch of water above. Bring to boil quickly, then remove from heat instantly and let stand for 13 minutes. Then place the eggs in cold water for easy pealing. For soft boiling, bring a saucepan half-filled with water to a boil, lower the egg in for 4-6 minutes then serve right away.","video_length":390,"videoname":"v046","techniques":"boil","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id045"},{"id":46,"title":"Boiling & Steaming Greens - Broccoli","description":"To keep your greens from becoming limp and flavorless, remember to cook them only until they're tender. It's also important to season the water. ‰Û¬‰Û¬Bring the pan of water to a boil and add salt - they say the water should be \"as salty as the sea.\" Cover your sauce pan to speed the initial boil, but always leave the lid off when you boil your veggies to preserve color. ‰Û¬‰Û¬Always clean your veggies well. After you drop them in the pan, bring the water back to a boil, then reduce heat until you get smaller bubbles (big ones could damage some vegetables). Remove veggies from the boil when tender, promptly rinse with cold water and serve.","video_length":428,"videoname":"v047","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id046"},{"id":47,"title":"Boiling & Steaming Root Vegetables - Potatoes","description":"The trick to boiling and steaming root vegetables is to make them tender without being mushy. ‰Û¬‰Û¬For best boiling, use Red Rose, White Rose or Yukon Gold potatoes. Wash the potatoes thoroughly, peel and cut into small chunks. Place in a saucepan and cover with an inch of cold water. Season with salt, then turn up the heat and bring to a boil. Make sure the potatoes stay well covered with water. Once you reach a boil, turn it back to a simmer. When tender, drain the water and then return to the stove, keep stirring until the excess water evaporates. Your potatoes should be ready to dry. ‰Û¬‰Û¬At this point, you're ready to begin preparing mashed potatoes using the recipe you see here.","video_length":536,"videoname":"v048","techniques":"boil","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id047"},{"id":48,"title":"Blanching, Concasse & Ice Baths","description":"Blanching keeps veggies crisp, flavorful and nutritious. It's also an essential part of peeling a tomato for concasse. ‰Û¬‰Û¬Put simply, blanching is boiling food very quickly. Bring a saucepan half-full of water to a vigorous boil, salt generously, and submerge your vegetable. Different varieties require different times - just look for a bright color and test for crispy tenderness. ‰Û¬‰Û¬When finished, submerge the vegetables in an ice bath immediately using a slotted spoon. This stops the cooking process immediately and helps seal in flavor. Salting your ice bath adds extra savor. ‰Û¬‰Û¬For a tomato concasse, core the tomato and place them in boiling water. Remove after five minutes and plunge into the ice bath. Then you can peel the tomato by scoring a criss-cross on the bottom and peeling away at the corners. Chop into chunks and you've got the base for your marinara.","video_length":464,"videoname":"v049","techniques":"boil","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id048"},{"id":49,"title":"Principles of Steaming - Baby Bok Choy","description":"Steaming is perfect for vegetables, fish and seafood because it's a more gentle way to cook. It's also extremely healthy. ‰Û¬‰Û¬For steaming, you can use a metal steamer insert, a bamboo steamer, or a metal colander. We recommend the bamboo option combined with a wok. ‰Û¬‰Û¬Assemble your wok and steamer and bring the water to a rapid simmer. Place your food evenly on the steamer and replace the lid. Different vegetables will require different cooking times - just check for crispy-tenderness and brightness of color. ‰Û¬‰Û¬Finally, be sure the water doesn't seep through the holes. In that case, you'd be boiling, not steaming, the vegetable.","video_length":515,"videoname":"v050","techniques":"steam","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id049"},{"id":50,"title":"Steamed Mussels with White Wine and Shallots","description":"While it's true that steaming makes it impossible to burn food, you can still over-cook it (of course, undercooking is possible as well). This means that, when it comes to fish and mussels, cooking time is extremely important. ‰Û¬‰Û¬One way to steam seafood is in a classic metal steam basket. Remember - if any of your mussels don't open during steaming, it means they were dead before cooking and should be thrown away. ‰Û¬‰Û¬A second way of steaming seafood is to wrap it in wet cooking parchment and pop it in the oven. Just be sure to seal the parchment tightly so the steam can't escape.","video_length":404,"videoname":"v051","techniques":"steam","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id050"},{"id":51,"title":"Principles of Poaching: Poaching - Court Bouillon","description":"A flavorful poaching liquid can be repurposed as a delicious broth or sauce for your meal. One example is the court bouillon. This kind of poaching (in addition to poaching in oil, which gives a stronger flavor) locks in moisture and flavor. ‰Û¬‰Û¬Court bouillon translates to \"short broth\" and is ideal for cooking fragile foods rapidly. Always start the broth cold with your meat already in the pan - especially with fish. Heat to a gentle simmer and maintain a temperature of 82 degrees Fahrenheit. ‰Û¬‰Û¬When poaching chicken, consider leaving the bone in and the skin on for additional flavor. Remember to skim the foam occasionally to maintain a clear broth free from cloudiness. The key is to maintain the temperature of your poaching liquid throughout the cooking process.","video_length":412,"videoname":"v053","techniques":"poach","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id051"},{"id":52,"title":"Perfect Poached Shrimp with Quick Cocktail Sauce","description":"Great poached seafood starts with freshness, so make sure you get the best available product at your market. ‰Û¬‰Û¬Poach fish in the oven - called \"dry poaching\" - by placing it in liquid that doesn't cover it completely and then covering the fish with parchment paper. A special dry-poaching pan or a smaller pan with two-inch sides is essential to this method. ‰Û¬‰Û¬For poaching shrimp, use the traditional \"wet\" method. Consider leaving the shell on for additional flavor. To prevent over-cooking, drop the shrimp into the boiling liquid then remove from the heat immediately. Once cooked - look for pink-orange flesh - remove and plunge into a bowl of cool water immediately. After that, peel, de-vein and enjoy.","video_length":733,"videoname":"v054","techniques":"poach","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id052"},{"id":53,"title":"Poaching Fruit - Port Wine Poached Pears","description":"For fruits that are out-of-season or not quite ripe, poaching offers a way to enjoy them immediately. ‰Û¬‰Û¬Cook the fruit in water sweetened with sugar, or, for pears and figs, consider sweetened red wine such as port. Either way, remember to keep your poaching syrup only lightly sweetened. When using spirits, add them to the syrup only after it has been reduced and cooled, not at the beginning of the poaching process. ‰Û¬‰Û¬Peel and core your fruit appropriately, and poach until tender. Allow to cool in the syrup so they absorb the flavors. Remove the fruit, then reduce the liquid. Pour the reduced syrup over the fruit and you're ready to serve.","video_length":506,"videoname":"v055","techniques":"poach","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":4,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id053"},{"id":54,"title":"Principles of Grilling: Grilled Ribeyes","description":"Grilling is perfect for steak, chicken, fish or vegetables. There are a variety of methods and techniques, but here are the basics you should remember: ‰Û¬‰Û¬Always keep your grill clean, and before you begin cooking, heat your grill to the appropriate temperature. Coal-cooking will take about 45 minutes of pre-heating. A thick ash on the coals indicates low heat, a light grey ash indicates medium heat and glowing red means high heat. Put three layers of coals on one side and one layer on the other to give you hotter and cooler zones for cooking. ‰Û¬‰Û¬Check your heat zones with your hand - place it palm-down at cooking height over the area of the grill you want to check and see how long you can keep it there. Five seconds is low heat, four seconds is medium heat, three seconds is medium-high heat, and two seconds is high heat. ‰Û¬‰Û¬For direct cooking, place the food right over the flame or coals. Use indirect grilling for more delicate foods. Keep a hot zone and a medium/cooler zone - the former for searing and marking and the latter for cooking the food through. ‰Û¬‰Û¬Use marinades for direct grilling to lock in flavor and moisture. Marinades without sugar can be added throughout cooking. If your marinade contains sugar, add it at the end of cooking so it doesn't burn. ‰Û¬‰Û¬For the perfect grilled rib eye, follow the recipe you see on the next tab. As a few tips, check doneness with a meat thermometer, or with pressure. Press the steak with your index finger or the flat of your fork - a rare steak is soft, a medium steak is firm but yielding and a well steak is firm. And above all else, remember to let steaks rest 5-10 minutes before serving.","video_length":484,"videoname":"v056","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id054"},{"id":55,"title":"Grilled Baby Back Ribs","description":"For fragile meats or larger cuts, indirect grilling is the way to go. One perfect example is baby back ribs. Cook the ribs slowly with the grill covered. Place a pan full of water inside the grill to maintain moisture. Braise the ribs throughout the process with your favorite BBQ sauce - just remember, this will increase cooking time because heat is released whenever you open the grill. ‰Û¬‰Û¬For a smokier flavor, cook with apple, cedar or hickory chips. Make sure you soak the chips for at least a half-hour beforehand so they don't just burst into flames. ‰Û¬‰Û¬You can also grill inside your kitchen - just wrap the ribs in foil and pop them in the oven. For this method, see the recipe on the next tab","video_length":573,"videoname":"v057","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id055"},{"id":56,"title":"Grilled Summer Vegetables: Vegetable Skewers","description":"Grilling veggies yields a delicious smoky flavor and a rich, caramelized texture. Size is important - if they're too small, they'll fall through the grates of your grill. If they're too big, they'll probably burn before the center gets done. And if the sizes are inconsistent, you'll have varying degrees of doneness. ‰Û¬‰Û¬Always oil your veggies when grilling to keep from sticking and to preserve moisture. Add lemon zest, garlic and spices to your oil for more flavor. Cook the larger ingredients first because the take longer. And to get those professional grill marks, press the vegetable gently and let it sit in place without moving it. ‰Û¬‰Û¬After you remove the vegetables, baste them with infused oil while still warm for additional flavor.","video_length":732,"videoname":"v058","techniques":"grill","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id056"},{"id":57,"title":"Bone-in Grilling: Teriyaki Chicken Pieces","description":"Grilling chicken can be challenging. Here are some tips to ensure success: ‰Û¬‰Û¬Prepare a brine in advance (as directed in the recipe on the next tab). Marinate the chicken in the brine, and in the meantime, wipe down your grill with an oil-blotted towel and pre-heat for hot and cool zones. Drain the chicken, mark it on the hot zone then move it to the cooler zone to finish out the cooking. Glaze the chicken toward the end of the process so it doesn't burn. Baste with the glaze liberally, using a silicone brush. You'll know your glaze is well cooked when it looks shiny, like a lacquer.","video_length":1018,"videoname":"v059","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id057"},{"id":58,"title":"Grilling Seafood: Shrimp, Scallops, Clams, Whole Fish","description":"Different types of seafood require different techniques. For shrimp, grill with the shell on - just split it down the back. You can also skewer the shrimp, especially if they're smaller (this keeps them from falling through the grill). Make sure to run it through length-wise so the shrimp doesn't curl up. ‰Û¬‰Û¬For scallops and calamari, use medium-high heat and make sure they're patted dry. Don't move them once on the grill - except to flip - this ensures good caramelization and grill marks. Be careful not to over-cook, and consider a skewer if the food is small. ‰Û¬‰Û¬For a whole fish, start with an extremely hot grill and a dry, lightly oiled fish to prevent sticking. Consider stuffing the inside with an aromatic herb blend. Use two spatulas to carefully turn the fish and keep it whole. ‰Û¬‰Û¬Finally, a note on mussels or clams: use a flat plate on the grill if you have one, or use some sheets of foil to capture the juices. Cook on high on your flat surface, pouring a little liquid like white wine, veggie broth or beer for steaming. Cover or put the lid down and cook for seven minutes. ‰Û¬‰Û¬For all seafood, beware of overcooking. Keep your grill on medium-high heat.","video_length":1357,"videoname":"v060","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id058"},{"id":59,"title":"Principles of Roasting - Perfect Roast Chicken","description":"The right pan is essential to good roasting. You need a strong and sturdy pan, large enough for the meat to fit in comfortable and to allow enough room for the hot air to circulate evenly. ‰Û¬‰Û¬For roasting, choose a moist piece of meat (save the tougher cuts for braising and boiling). Consider rib roasts, pork or beef loins or whole chickens. Make sure your meat sits at room temperature for about 30 minutes. ‰Û¬‰Û¬For chicken, use a roasting pan on a rack - otherwise, if the chicken makes direct contact with the pan, it will steam instead of roast. With a rack, you'll get a good, crispy bird. ‰Û¬‰Û¬Season your meat (or stuff it if it's a bird) and wrap with kitchen twine to keep it all together. Place in a hot oven and then turn it down to a lower temp (from 500 to 350, for instance) for full roasting. This helps make a crust to lock in juices. ‰Û¬‰Û¬When testing for done-ness, remember that a large cut of meat may continue to cook for ten minutes after you remove it from the oven. Let the meat rest before serving so the juices can soak in thoroughly. And of course, remember to save the pan juices to make a delicious sauce.","video_length":1205,"videoname":"v061","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id059"},{"id":60,"title":"Larger Cuts - Standing Rib Roast","description":"Roasting larger cuts can actually be quite simple. Again, begin with the proper pan - always be sure to have a rack so the meat doesn't rest directly on the pan. ‰Û¬‰Û¬Let the rib roast sit at room temperature prior to cooking. Seasoning is critical - in this recipe, we salt-crust the meat - this creates a crunchy outer layer that locks in moisture and flavor. Ideally, this cut of meat should be cooked to medium-rare.","video_length":793,"videoname":"v062","techniques":"roast","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id060"},{"id":61,"title":"Smaller Cuts - Pan-Roasted Rack of Lamb","description":"For smaller cuts of meat like pork chops and rack of lamb, try pan-roasting. The purpose is to complete a quick-sear for texture and then finish for a few minutes in a hot oven. ‰Û¬‰Û¬The best pork chops are double-cut - talk directly to your butcher for these. Don't use the thin, pre-packaged chops you see in the cooler. The results are dry, flavorless and less than ideal. For rack of lamb, use the ribs as a natural rack during roasting. Once you're ready to carve, cut along every second rib for thick, juicy portions. ‰Û¬‰Û¬Use a good sturdy pan you can take from the stovetop directly into the oven. That means no plastic or flammable handles. Test for doneness by pressing on the chop with your finger - the chop should give a little and the juices should run clear. A pool of juice means it's over-done, and pink juices mean it's under-done. It's important to rest chops before enjoying.","video_length":616,"videoname":"v063","techniques":"roast","difficulty":"difficult","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id061"},{"id":62,"title":"Whole Roasted Fish with Fennel, Olives and Thyme","description":"Roasting a whole fish is actually more simple than you think. ‰Û¬‰Û¬Start with a good fish. Go to the market, and look for one that is firm, but not slimy. Get a fish with the scales already removed. Give it a smell - if you catch a scent of the ocean, the fish is good. If it smells like ammonia, the fish has gone bad. And don't be shy about getting a pre-gutted fish - it makes everything faster and easier. ‰Û¬‰Û¬Once you've cooked the fish, you'll know it's done by inserting a knife near the head next to the spine. If the meat pulls away easily, it's done. Cut off the fins, then run your knife along the spine and the meat should pull away. Flip the fish over and repeat. Once you can see all the bones, grab the end closest to the tail and gently pull upward - the skeleton will come right out. Next, fold the fish back together so it's whole again, plate and serve.","video_length":993,"videoname":"v064","techniques":"roast","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id062"},{"id":63,"title":"Roasted Vegetables - Parmesan Broccoli, Carrots and Parsnips with Goat Cheese & Honey","description":"Roasting vegetables is one of the best ways to unlock their natural flavors and sugars - all while preserving the nutritional value. It's a pretty simple process - just place them on an oiled sheet, season with herbs, and roast in the oven until tender and caramelized. ‰Û¬‰Û¬The big hint here: put your sheet pan in the oven to pre-heat...this will give the vegetables a pleasingly crisp exterior and help ensure they don't stick.","video_length":766,"videoname":"v065","techniques":"roast","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":5,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id063"},{"id":64,"title":"Principles of Braising - Red Wine Braised Short Ribs","description":"Braising is relatively easy. And though it can be time-intensive, the results are amazing. ‰Û¬‰Û¬Braising is best for tough cuts of meat, like beef brisket, pork shoulder and short ribs. Here's a good rule: you'd never braise a cut of meat you'd order medium-rare in a restaurant. ‰Û¬‰Û¬A final tip: if you have time and you're not serving your braised dish immediately, let the meat cool in the strained liquid. This will give you a dish that is more moist and flavorful.","video_length":633,"videoname":"v066","techniques":"braise","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id064"},{"id":65,"title":"Vegetables - Slow Braised Collard Greens","description":"Braising vegetables is a great no-fuss way toward phenomenal flavors. Certain classes of vegetables hold up well to the long cooking process of braising...leeks and greens are two good examples. ‰Û¬‰Û¬It's important to clean your veggies well before braising. Nobody likes a gritty dish. For leeks, cook until they are tender when pierced at the base with the tip of a knife. For the heartier collard green, cook until the entire green is tender.","video_length":747,"videoname":"v067","techniques":"braise","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":5,"iap_id":"com.topchefu.iap.lesson.id065"},{"id":66,"title":"Principles of Stewing - Moroccan Lamb Stew","description":"Stewing is like braising, with a few important differences: First, stewing is done with small cuts of meat instead of large ones. Second, in stewing, the meat is fully immersed in liquid (in braising, it's partially covered). Choose virtually any meat for your stew - lamb, rabbit, beef, or pork. It's best to buy a whole cut of meat and then cut it yourself. That way you know the level of tenderness you're dealing with.","video_length":1358,"videoname":"v068","techniques":"stew","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id066"},{"id":67,"title":"Principles of Frying - Crispy Fried Chicken Wings","description":"Deep-fried foods are delicious -- and not as fatty as you may think. Here are the basics you need to know: ‰Û¬‰Û¬Use the right tools. You'll need a heavy-duty Dutch oven, a pan, a thermometer to monitor your oil temp, and some cloth liner. You'll also need a spider to dip the product in and out. ‰Û¬‰Û¬Use the right oil. Canola, vegetable, safflower and peanut oil are all good choices. Other oils begin to smoke at high temperatures and will not work for deep frying, where your oil should be at precisely 360F. ‰Û¬‰Û¬Use the right amount. Never fill your pan more than 2/3 full - oil expands when hot, and also when you add other ingredients. You don't want it to bubble over and injure you. ‰Û¬‰Û¬Use the right meat. Look for pieces that are not too big. And be sure to season the meat as soon as it comes out of the fryer - while there's still oil on it. ‰Û¬‰Û¬When you're finished, let the oil cool on the stovetop, then strain it into a safe container and refrigerate. You can re-use it 2-3 times for up to a week. When it expires, don't pour it down the drain - put it in a sealed container with a screw-on lid and throw it out with the garbage.","video_length":750,"videoname":"v069","techniques":"fry","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id067"},{"id":68,"title":"Pan Frying - Breaded Pork Cutlets","description":"When pan frying, you'll use less oil (hence its other name, \"shallow frying\"). Two inches of oil heated to 350F is just about right. A cast iron skillet works best. ‰Û¬‰Û¬Though in this lesson we cooked pork, you can also shallow-fry crispy fish fillets, breaded chicken breast, or anything that's thin enough to fry quickly.","video_length":623,"videoname":"v070","techniques":"fry","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id068"},{"id":69,"title":"The Perfect French Fries","description":"The French Fry is the perfect fried vegetable. Remember these hints to get restaurant quality fries in your home: ‰Û¬‰Û¬Use oil with a high smoking point, like canola oil, vegetable oil or peanut oil. Cut your potatoes to the same size - not too thick. Soak in water for 30 minutes to remove the excess starch. Make sure they're dry before putting them in the pan - hot oil and water do not mix. ‰Û¬‰Û¬Heat your oil to 350F and cook for 2-3 minutes. For thicker fries, your cooking time will be longer. ‰Û¬‰Û¬If you'd like, you can cut and blanch the fries then store them in the fridge until you're ready for fry-time later on.","video_length":488,"videoname":"v071","techniques":"fry","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id069"},{"id":70,"title":"Principles of Confit - Duck Confit","description":"Confit is a classic French form of food preservation and preparation. This lesson focuses on duck confit, but the process can be applied to almost anything - the consistent theme is that confit always involves cooking cured products for very long periods of time at very low heat. ‰Û¬‰Û¬After you've cured your meat and cooked it in the oven, let it cool in its own fat. Finish by searing the exterior for a crispy crust. ‰Û¬‰Û¬The process of confit enables you to store prepared and cooked meats for 2 to 3 weeks in your refrigerator, so long as it stays in its own fat and oils. Remember, you can confit just about anything - from fruits and vegetables to just about any kind of meat.","video_length":437,"videoname":"v072","techniques":"confit","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":6,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id070"},{"id":71,"title":"Potatoes I - Rosemary Fingerling Potatoes, Smashed Potatoes with Spicy Red Pepper Aioli","description":"The beauty of roasting potatoes is creating a delicious dish without masquerading the natural flavors of the primary ingredient. ‰Û¬‰Û¬Roast potatoes with the skins on, and toss them well in oil and spices. For fingerling potatoes, you can even roast them whole. Pre-heat your sheet tray in the oven to help keep the potatoes from sticking. Cook on high heat for a crispy exterior and moist interior. ‰Û¬‰Û¬For smashed potatoes, use Yukon Golds or New Potatoes. Start by washing and cleaning the potatoes and then placing them in cold water. Bring the water to boiling and salt the hot water well. Remember - you can combine other root vegetables with your potato puree for more inventive flavors.","video_length":1159,"videoname":"v073","techniques":"roast","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id071"},{"id":72,"title":"Potatoes II - Creamy Potato-Bacon Gratin","description":"Potatoes gratin is great comfort food. Here are some helpful tips: ‰Û¬‰Û¬Use a mandolin to get your potato slices the right thickness. Focus on consistent, even cuts for even cooking. Don't wash your slices - you want those starches in the dish. ‰Û¬‰Û¬Remember to use a big enough dish to prevent overflow. Cook with the dish on a sheet tray as insurance against spill-over. ‰Û¬‰Û¬The dish takes awhile to cook, so cover with foil to avoid over-browning the top","video_length":820,"videoname":"v074","techniques":"roast","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id072"},{"id":73,"title":"Roots I - Roasted Squash Ravioli with Brown Butter Sage","description":"Preparing squashed-stuffed ravioli starts with the squash itself. Splitting the squash and roasting it creates the perfect texture and flavor. ‰Û¬‰Û¬If you're preparing a dish with pumpkin, remember to save the seeds so you can roast them later as a snack or for salad toppings.","video_length":1060,"videoname":"v075","techniques":"roast","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id073"},{"id":74,"title":"Roots II - Sweet Potato and Apple Soup","description":"For this recipe, the root vegetables - parsnips and sweet potatoes - are sweated instead of braised. That way they retain their natural flavor without caramelization. ‰Û¬‰Û¬When sweating, be careful not to salt too early -- this will just draw the flavor out. ‰Û¬‰Û¬Root vegetables are great for soups because they lend a natural creaminess, cutting down on the amount of cream you need to add. And for an ultra-fine finish, you can always pass your final product through a sieve to ensure enhanced smoothness.","video_length":867,"videoname":"v076","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id074"},{"id":75,"title":"Roots III - Roasted Beet Salad, Glazed Rutabaga with Honey & Thyme","description":"Success with root vegetables like rutabagas and beets begins with washing them thoroughly. Use a soft scrubbing brush or paring knife to really get the tips clean. ‰Û¬‰Û¬Roast beets inside a pouch on top of a sheet tray - this will help insure you against the mess of spill-over. Prick the pouch for a hybrid roast/steam. Afterward, feel free to wear gloves when you peel the beets so you don't end up with purple hands. ‰Û¬‰Û¬Rutabaga, on the other hand, can be cooked in a hot pan with olive oil.","video_length":1253,"videoname":"v077","techniques":"roast","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id075"},{"id":76,"title":"Greens I - Broccoli with Parmesan Breadcrumbs, Green Beans with Shallots","description":"For broccoli, remember that there's a lot of flavor in the stems, so don't limit yourself to the florets. Do remember to trim off the tough root ends, however. ‰Û¬‰Û¬The trick to green beans is blanching for bright green color and ultimate crispness. Remember to salt your ice water bath during this part of the process.","video_length":957,"videoname":"v078","techniques":"roast, boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id076"},{"id":77,"title":"Greens II - Shaved Brussels Sprout Salad with Cremini Mushrooms","description":"Brussels sprouts are often sautÌ©ed or roasted, but here we're serving them raw. It's a sort of coleslaw made from a baby cabbage. ‰Û¬‰Û¬Feel free to use loose Brussels sprouts, but also look for a cluster of them on the stalk.","video_length":391,"videoname":"v079","techniques":"salad","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id077"},{"id":78,"title":"Eggplant Parmesan","description":"There are two basic elements of eggplant parmesan: the eggplant and the marinara sauce. We've already covered marinara, so here are some tips on eggplant: ‰Û¬‰Û¬Always salt the eggplant after slicing - this helps retain moisture and it helps the vegetable keep its shape. This process is called \"degorging.\" ‰Û¬‰Û¬Eggplant is notorious for soaking up a lot of oil, so make sure you bread it evenly and thoroughly.","video_length":583,"videoname":"v080","techniques":"fry, bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id078"},{"id":79,"title":"Introduction to Beans","description":"When you cook with dried beans instead of canned beans, you maintain complete control of your flavorings and seasonings. Here are some of the most common types of dried beans: ‰Û¬‰Û¬Favas - rich, dense and slightly bitter. ‰Û¬‰Û¬Borlotti - speckled, nutty, and great in Italian cuisine. ‰Û¬‰Û¬Garbanzo - also called chickpeas, they're dense, round and savory. ‰Û¬‰Û¬Black Beans - most often found in Latin American cuisine, they've got a strong earthy flavor. ‰Û¬‰Û¬Cannellini Beans - smooth and nutty, it's often found in minestrone soup and bean salads. ‰Û¬‰Û¬Though dried beans do last awhile, it's important to eat them while they're relatively fresh. Store them at room temperature in an air-tight container; never in the fridge. To shorten the cooking time, try soaking your beans. There are two methods: the cold (or long) soak method and the hot (or quick) soak method. ‰Û¬‰Û¬For long soaking, place them in a large vessel and cover with 3x the amount of water. Soak for eight hours or a little more - but never more than 12 hours. ‰Û¬‰Û¬For quick soaking, boil the beans in water for two minutes. Remove from heat and cover the pot, letting stand for one hour. Then discard the soak water and cook.","video_length":246,"videoname":"v081","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id079"},{"id":80,"title":"Beans - Cassoulet","description":"A cassoulet is what's called a \"peasant dish.\" It's a kind of stew that features three main components: beans, a confit of duck or goose and an herbed meat. ‰Û¬‰Û¬When you're preparing your beans, a ham hock or other savory meat element will add phenomenal flavor. As for the stew itself, be sure to reduce after adding wine and tomatoes, and always ad a bouquet garni for added aroma and complexity.","video_length":792,"videoname":"v082","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":7,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id080"},{"id":81,"title":"Introduction to Eggs - Hard & Soft Boiled Eggs","description":"An egg is very basic - just two parts, an egg and a white - but its possibilities are nearly endless. ‰Û¬‰Û¬To separate the eggs and whites, crack the egg and pour the yolk from half to half, or wet your hands and dump the egg right into your palm - the white will naturally spill over into the bowl. ‰Û¬‰Û¬Use fresh eggs for frying and poaching. Use older eggs for boiling - they're easier to peel. You can tell the difference by putting an egg in a glass of water...if it's older it will float, if it's fresher it will not. ‰Û¬‰Û¬For the perfect hardboiled egg, place in cold water with one inch of water above. Bring to boil quickly, then remove from heat instantly and let stand for 13 minutes. Then place the eggs in cold water for easy pealing. For soft boiling, bring a saucepan half-filled with water to a boil, lower the egg in for 4-6 minutes then serve right away. ‰Û¬‰Û¬To fry an egg, use a non-stick pan. Add a TBSP of olive oil and heat until it shimmers. Crack the egg in, then use a spoon to baste the top with hot oil. Turn the heat down to cook. Use a spatula to flip it for \"over-easy.\"","video_length":333,"videoname":"v083","techniques":"boil","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id081"},{"id":82,"title":"Poached Eggs - Eggs Benedict","description":"Though poaching eggs can be tricky, Eggs Benedict makes it all worthwhile. ‰Û¬‰Û¬The recipe on the next tab features an entire step-by-step, but here are a few helpful hints: When poaching eggs, always use fresh ones. Add a splash of vinegar to the water to help the egg coagulate. And crack the egg in a small bowl first so the yolk is less likely to break in your poaching water.","video_length":485,"videoname":"v084","techniques":"poach","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id082"},{"id":83,"title":"Scrambled Eggs, French Herb Omelette","description":"For the full how-to on scrambling eggs and making the classic French omelette, check out the recipe tab. You can find some helpful hints here: ‰Û¬‰Û¬For scrambled eggs, use a non-stick pan for optimal results. Move the eggs around consistently to create tender, super-soft curds. Remove the eggs from heat promptly once they're finished. ‰Û¬‰Û¬For the omelette, remember that practice makes perfect. Prep just like you would with scrambled eggs. Add butter to your skillet; wait until it foams then pour in the egg mixture. Add filling once the egg has settled, fold over on itself, then tap the pan on the cook top to loosen the omelette before sliding it out.","video_length":576,"videoname":"v085","techniques":"saute, scramble","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id083"},{"id":84,"title":"Spring Vegetable Frittata","description":"A frittata shares many characteristics with the elegantly simple scrambled egg, but there are two important differences: the frittata typically features larger curds, and it is finished in the oven instead of the pan. ‰Û¬‰Û¬The key: light, puffy egg. To accomplish this, make sure your oven is good an hot when you slide the frittata in. It also helps to incorporate as much air as possible into the eggs when you're whipping them up.","video_length":759,"videoname":"v086","techniques":"bake","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id084"},{"id":85,"title":"Coddled Eggs with Bacon, Baked Eggs with Spinach & Goat Cheese","description":"To coddle eggs simply means to cook in a water bath. If you don't have a coddler as your cooking vessel, use a ramekin. Remember to rub the inside with butter so your egg doesn't stick, and to make sure you've covered the top tightly with foil before lowering it into your bain marie (that's the French term for water bath). ‰Û¬‰Û¬For baked eggs - or shirred eggs - use a similar vessel as you did with coddled eggs. Remember to butter it.","video_length":660,"videoname":"v087","techniques":"bake","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id085"},{"id":86,"title":"Savory Cheese Souffle","description":"Souffles have a reputation for being difficult, but by following a few basic steps you can prepare a perfect one every time. ‰Û¬‰Û¬Choose the right vessel: Select a ramekin with straight sides so the souffle rises evenly. Be sure to coat the inside with butter - be thorough, any uncoated part of the ramekin will cause your souffle to stick. ‰Û¬‰Û¬You'll also want to whip well. Start by whipping your egg whites slowly, then gradually increase your speed. Otherwise, the air bubbles will be bigger, thus creating a less stable souffle. Go for medium-stiff peaks - if they're too stiff, the souffle will be too dry and not structurally stable. If they're not stiff enough, the souffle won't hold shape. ‰Û¬‰Û¬Finally, be sure to fold the whites into your batter mixture a little at a time. If you dump it all in at once, you'll lose the air you've worked so hard to incorporate. And once you've got them in the oven, there's no turning back - be prepared to serve immediately.","video_length":659,"videoname":"v088","techniques":"bake","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id086"},{"id":87,"title":"Cheese 101 - Building A Cheese Platter","description":"No need to be intimated by the world of cheeses. Here are the basics you need to know: ‰Û¬‰Û¬Cheese is made from cow, sheep, or goat milk. To learn about the differences of each, try young, mild cheeses made from each variety of milk. ‰Û¬‰Û¬Texture is as important as flavor. Since textures change as the cheese ages, try visiting your local cheese shop and sampling the same cheese at different ages. ‰Û¬‰Û¬Like wine, the flavor of cheese is affected by climate and geography. Seasonality of the milk plays a role as well. That's why a New Zealand Parmesan-style cheese tastes so different from a true Parmesan Reggiano. ‰Û¬‰Û¬When assembling a cheese platter, stick to 3-6 types. Select different flavors and textures, but consider tying it all together with a theme (cheeses from a single country, for example). Pair the cheeses with neutral crackers to they don't interfere with the flavor, and complement your platter with nuts, fruit spreads and olives.","video_length":438,"videoname":"v089","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id087"},{"id":88,"title":"Chipotle Mac-n-Cheese","description":"Mac-n-Cheese is great comfort food - and you don't have to get it out of a box. Make your own with several different cheeses, selected for complementary textures and flavors. ‰Û¬‰Û¬The complete method is on the recipes tab, but remember to consider topping your mac-n-cheese with bread crumbs for a pleasing crunch","video_length":761,"videoname":"v090","techniques":"bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id088"},{"id":89,"title":"Traditional New England Clam Chowder","description":"This creamy clam chowder has a rustic character and classic smoothness. Here are a few tips to go along with the full recipe: ‰Û¬‰Û¬Pick through your clams and discard any broken ones you might find. Once you've steamed them, you'll also want to throw out any that didn't open. Strain your broth well - that gritty crunch will spoil the creaminess of the chowder. ‰Û¬‰Û¬Remember to use Yukon Gold potatoes - they're the creamiest you can get, and floury potatoes will simply disintegrate. ‰Û¬‰Û¬Taste the soup at every stage and season accordingly.","video_length":560,"videoname":"v091","techniques":"boil","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id089"},{"id":90,"title":"Creamy Chicken Curry with Raita","description":"Chicken curry takes awhile to cook, but its certainly worth the wait. ‰Û¬‰Û¬The long cook time means you should keep a few things in mind, like using a heavy pot that can withstand sustained heat. ‰Û¬‰Û¬The raita is an important accompaniment to the curry. Season yours just the way you like - it's up to you.","video_length":769,"videoname":"v092","techniques":"braise","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":8,"chef_id":4,"iap_id":"com.topchefu.iap.lesson.id090"},{"id":91,"title":"Breaking Down a Whole Chicken","description":"Just one of the many benefits to breaking down a whole chicken is that you will know it's fresh, and where it came from. ‰Û¬‰Û¬Keep both a chef's knife and kitchen shears on hand when dealing with a whole bird and use whichever you are most comfortable with when cutting through the bone. Don't discard these bones; these are perfect for making stock. Make sure to clean up properly so you avoid any contamination.","video_length":405,"videoname":"v093","techniques":"technique","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id091"},{"id":92,"title":"Bone-In Breast - Chicken Marsala with Mushrooms","description":"Pan roasting bone-in chicken keeps the meat moist and tender. A tip to achieving great color is to lightly dust the chicken with flour before placing it skin-side down in a hot, oiled pan. ‰Û¬‰Û¬Be sure not to fuss with the chicken; allow it to brown on one side before you flip it. Go ahead and experiment with the use of different herbs and wines to achieve a unique and tasty sauce.","video_length":669,"videoname":"v094","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id092"},{"id":93,"title":"Boneless Breast - Chicken Paillard with Arugula and Lemony Vinaigrette","description":"Chicken Paillard requires a flattened boneless chicken breast. To achieve this, pound it evenly between two sheets of oiled plastic wrap. Make sure that you clean as you go to avoid any cross contamination. ‰Û¬‰Û¬Season and quickly sear or grill the meat over a medium high heat for about two minutes on each side. You'll plate it with fresh arugula and vinaigrette dressing. This is a simple, yet elegant meal that is quick and easy to prepare.","video_length":1110,"videoname":"v095","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id093"},{"id":94,"title":"Wings - Sweet and Spicy Chicken Wings with Slaw","description":"Here are some tips for preparing great spicy fried chicken. ‰Û¬‰Û¬Separate the chicken wings into small, manageable pieces by cutting where the joints connect. Preheat your pan and keep the oil at about 350 degrees and watch for splattering. ‰Û¬‰Û¬To prepare any type of slaw, it's best to shave the vegetables into thin slices; a mandolin works great for this. Prepare the slaw while the wings are frying and be sure to clean as you go.","video_length":450,"videoname":"v096","techniques":"fry","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id094"},{"id":95,"title":"Legs and Thighs - Coq Au Vin","description":"\"Coq Au Vin\" translates to \"chicken cooked in wine.\" Here are some tips to make this French classic as great as can be. ‰Û¬‰Û¬It is important to season the meat before dredging the chicken in flour to lock in flavor. Preheat oil over medium-high heat; grapeseed oil is good for this purpose as it has a higher heating point. ‰Û¬‰Û¬Vegetables are cooked separately. For the sauce, the wine is the top flavor in the dish and the richness is balanced by adding stock while cooking.","video_length":748,"videoname":"v097","techniques":"braise","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id095"},{"id":96,"title":"Southern Fried Chicken","description":"Here's a shallow-pan way to enjoy this comfort food classic. ‰Û¬‰Û¬It is not necessary to deep fry chicken to seal in flavor. Using a deep cast-iron pan allows for crispy fried chicken, and it is important to use a neutral cooking oil. ‰Û¬‰Û¬Cooking time will vary depending on the size of each piece of chicken. Be sure that you watch for splattering while cooking and don't let it burn.","video_length":455,"videoname":"v098","techniques":"fry","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id096"},{"id":97,"title":"Grilled Spatchcock Chicken with Lemon and Rosemary","description":"Spatchcock indicates that the chicken was flattened by removing the backbone, and then butterflied. This is a faster method for grilling a whole chicken, whether on the barbecue or an indoor grill. ‰Û¬‰Û¬Marinating chicken in a lemon-salt based marinade adds flavor, but should not be done longer than twenty-four hours because the chicken will begin to cure. Add the chicken to a hot grill, skin-side down, on medium heat. Keep it flat by placing parchment paper on the chicken, topped with a heavy pan.","video_length":455,"videoname":"v099","techniques":"grill, roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id097"},{"id":98,"title":"Turkey Breast - Stuffed Turkey Roulade","description":"With this recipe, there's no reason to wait until the holidays to enjoy stuffing and turkey. ‰Û¬‰Û¬Begin by preparing the stuffing. The stuffing should have a balance of flavors: savory, tart and herbs. It is important to allow the stuffing to cool before placing it inside the turkey, so be sure to refrigerate it until it is the same temperature as the turkey. ‰Û¬‰Û¬Season the inside and outside of the turkey liberally before placing the stuffing on it and rolling it up and trussing it with kitchen twine. Remove excess moisture to aid in crisping up the skin while cooking.","video_length":1284,"videoname":"v100","techniques":"roast","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id098"},{"id":99,"title":"Quail - Grilled Quail with Caramelized Honey Glaze","description":"For this recipe, start by using the spatchcock method to prepare quail for the grill. Remove excess moisture from the birds to prevent them from sticking to the grill. ‰Û¬‰Û¬Be careful when preparing the polenta; it is important to have the correct ratios of liquid to grain, and make sure that you cook it over a low heat for the recommended time to prevent lumps, adding small amounts of water if necessary. Remember, the mascarpone cheese and butter will provide the richness and flavor to the polenta.","video_length":804,"videoname":"v101","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id099"},{"id":100,"title":"Cornish Hen - Moroccan Spiced Game Hens with Couscous","description":"These small birds pack some big flavor. First prepare the stuffing before working with the Cornish hen. Your choice of cooking oil will affect the flavors as well as the heating point. ‰Û¬‰Û¬A Moroccan spice mix often carries a palette of flavors: sweet, sour and savory. Toasting the couscous before adding liquid will keep the grains separate and provide better texture. ‰Û¬‰Û¬Cornish hens are smaller and can be roasted at a high heat, but be careful not to overcook them. Be sure that the stuffing is the same temperature as the bird before you stuff the bird. Roast for up to thirty minutes, or 165 degrees.","video_length":1004,"videoname":"v102","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id100"},{"id":101,"title":"Duck - Orange Glazed Duck Breast","description":"Duck is poultry, and because of the high fat content it is rich in flavor. Trim the duck and keep excess fat to use when roasting potatoes or making French fries. ‰Û¬‰Û¬Seasoning the skin aids in proper crisping; place the duck in a cold pan and bring it to a high heat to crisp the skin. Be careful that you do not fry the duck; rather pull the fat away from the duck as it browns and pour out any excess fat. ‰Û¬‰Û¬Finish by topping the sliced duck with the fresh orange glaze. Star anise imparts a unique flavor to the glaze. Play with other flavors to add different tastes to the dish.","video_length":727,"videoname":"v103","techniques":"roast","difficulty":"moderate","lesson_length":"easy","notes":"","favorite":0,"mastered":0,"course_id":9,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id101"},{"id":102,"title":"Introduction to Pork - The Cuts","description":"Pork is an inexpensive meat to include in your cooking, and there are different cuts to use in a variety of dishes. ‰Û¬‰Û¬Whether you choose pork loin, chops, ribs or even bacon, it is important to know which cuts are best for your meal, which are best for the oven and which are best on the grill.","video_length":534,"videoname":"v104","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id102"},{"id":103,"title":"Chops - Rosemary Roasted Pork Cops with Red Wine & Grapes","description":"A bone-in pork chop is one of the more popular cuts of pork, and it is recommended to tie it with kitchen string to have a compact cut prior to cooking. ‰Û¬‰Û¬Salt enhances the flavor of the pork. Grapeseed oil in a hot pan is best to sautÌ© the pork because of its high smoke point. Allow the meat to sear properly in the pan before turning it and finish up in a 350 degree oven. Use the frying pan to create a pan sauce made with traditional flavors, or the flavors of your choice.","video_length":952,"videoname":"v105","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id103"},{"id":104,"title":"Tenderloin - Grilled Pork Tenderloin with Apple & Cherry Chutney","description":"Pork tenderloin is a lean, succulent cut of meat, with very little fat. Because of this you will need to season it liberally. ‰Û¬‰Û¬Use granny smith apples as a base to accompany the pork. They hold their shape and impart the perfect flavor. First prepare the chutney, then the pork. When serving, be sure that you cut the pork against the grain to aid in maintaining the tenderness of the meat.","video_length":1003,"videoname":"v106","techniques":"grill","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id104"},{"id":105,"title":"Ribs - Chinese Sticky Spare Ribs","description":"Spare ribs have more fat than baby back ribs and makes this cut of pork rib very tender. ‰Û¬‰Û¬The pork preparation is basic, and cooked in the oven, with the key flavors being a result of the simple glaze. To avoid burning, don't over glaze the ribs. Allow them to cook slowly and baste them with the glaze multiple times during the cooking process for the perfect tangy spare ribs","video_length":425,"videoname":"v107","techniques":"roast","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id105"},{"id":106,"title":"Shoulder - Ketchup & Cider Braised Shoulder","description":"Pork shoulder, or Boston butt, is a very large cut of meat. Use a large amount of grapeseed oil in the pan and bring it to a high heat point. Make sure to remove moisture from the pork before putting it in the hot pan to brown. ‰Û¬‰Û¬Remove fat from the pan and allow it to cool completely before disposing of it. Do not pour it down your drain. ‰Û¬‰Û¬The pork will take a long time to cook; have patience. Taste the sauce before plating, and generously spoon the sauce and vegetables over the braised pork.","video_length":627,"videoname":"v108","techniques":"braise","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id106"},{"id":107,"title":"Belly - Slow Roasted Pork Belly with Collard Greens","description":"Pork belly is simply another name for fresh bacon. Prepare a whole, seasoned pork belly sealed in foil in the oven, steaming it, then open and roasting it will make the meat rich and soft. Cut crosshatch marks into the fat on the pork belly to release the fat during cooking. Use grapeseed oil to render the bacon and cook the collard greens. ‰Û¬‰Û¬Apple cider vinegar will add punch to this dish, and will please the palate. Although the dish takes a few hours to prepare and cook, it is well worth it","video_length":783,"videoname":"v109","techniques":"roast","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id107"},{"id":108,"title":"Bacon - Grilled Cheese with Bacon and Egg","description":"There is a benefit to getting a slab of bacon rather than pre-sliced. The biggest pro: you have the ability to control the thickness of the cut. ‰Û¬‰Û¬Bacon can be used in a variety of dishes: crumbled, sliced or in lardons. It is complimented in a sandwich with the flavors of sourdough, apples and Dijon mustard, with grilled white cheddar cheese. Putting these ingredients together makes a basic sandwich with a flavorful twist.","video_length":749,"videoname":"v110","techniques":"grill","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id108"},{"id":109,"title":"Country Sausage, Spicy Italian Links","description":"By making your own sausage you know what goes into the grinder, and best of all, the process isn't that difficult. The best meat for this is pork shoulder, and it should be diced and chilled before you use it. Make sure there is marbling in the meat to ensure it does not dry out. ‰Û¬‰Û¬Use a frozen grinder attachment and chilled bowls, with the coarse grind attachment, season the meat and use a funnel attachment or pastry bag to stuff the casings.","video_length":892,"videoname":"v111","techniques":"grill, saute","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id109"},{"id":110,"title":"French Country Pate with Dijon & Cornichons","description":"Pate is a blend of meats and seasonings and typically organ meat, cooked in a water bath, in a ceramic terrine mold lined with bacon and then cooled. ‰Û¬‰Û¬The combination of textures and liquid is very important and aids in binding everything together. Cook until 145 degrees internal temperature is reached, and finish up to press out liquid over night, then slice and serve.","video_length":1280,"videoname":"v112","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":10,"chef_id":10,"iap_id":"com.topchefu.iap.lesson.id110"},{"id":111,"title":"Introduction to Beef - The Cuts","description":"Meat is muscle tissue and meat from a high active muscle is best braised, and has high flavor, but tough texture. A lesser active muscle, such as tenderloin has less flavor. Becoming familiar with the different cuts will ensure that you choose the best meat for your dish. ‰Û¬‰Û¬Lamb and beef are similar in cuts, but typically leg of lamb is the most commonly used, along with the shank. Prepare a French-trimmed rack of lamb for a dramatic presentation.","video_length":285,"videoname":"v113","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":9,"iap_id":"com.topchefu.iap.lesson.id111"},{"id":112,"title":"Pan Seared Strip Steaks with Green Peppercorn Sauce","description":"New York strip is a full-flavored cut of beef. Season the meat liberally with salt to pull out excess moisture and enhance the flavor. ‰Û¬‰Û¬Pan-cooked strip steak should be cooked over a high heat; grapeseed oil is recommended because of its high smoke point. Be sure to remove excess moisture from the meat before adding it to the hot pan and you will achieve a good sear to the meat. Simple to prepare and served with an accompanying sauce, this is always a crowd pleaser.","video_length":1479,"videoname":"v114","techniques":"grill, saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":9,"iap_id":"com.topchefu.iap.lesson.id112"},{"id":113,"title":"Braised Beef Brisket","description":"Braising a brisket of beef results in a comforting, delicious dish. Season the beef liberally and add to a hot pan coated with oil to achieve a good sear. When braising beef, everything stays in one pan so you must make sure that your pan is large enough, and that it is heat proof. ‰Û¬‰Û¬Cut the vegetables into large pieces to keep them from disintegrating during the slow cook time in the oven. Remember to cut the meat across the grain just before serving; this keeps the meat tender.","video_length":1192,"videoname":"v115","techniques":"braise","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":9,"iap_id":"com.topchefu.iap.lesson.id113"},{"id":114,"title":"Stew - Beef Bourguignon","description":"A warm comforting stew is perfect for a cool evening. A stew uses smaller cuts of meat, cooked in a liquid. Because of this it is acceptable to use a tougher cut of beef. ‰Û¬‰Û¬Cut the vegetables into large, yet manageable pieces so that their shape will be maintained. Allow the beef and vegetables to marinate overnight. Even in a stew it is important to sear the beef. Make sure to do this before combining everything and cooking in a Dutch oven or large pot.","video_length":1218,"videoname":"v116","techniques":"stew","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":9,"iap_id":"com.topchefu.iap.lesson.id114"},{"id":115,"title":"Grilled Skirt Steak Fajitas","description":"Flank steak is lean and perfect for quick-cooking. Dress up the meat with various spices and allow it to marinate to change the flavor. There is no need to marinate this cut of beef longer than 30 minutes. ‰Û¬‰Û¬Cook over a high heat for no more than ten minutes total, and accent the dish with grilled vegetables. Make sure to slice the cooked meat across the grain and serve with warmed tortillas and your choice of sides.","video_length":1179,"videoname":"v117","techniques":"grill","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id115"},{"id":116,"title":"Bacon Cheddar Cheese Burgers with Avocado","description":"Use a blend of meats to make the perfect burger; chuck is the basic beef to include. Mixed with ground skirt steak, short rib and even bacon you will have a blend that will give you a blazing burger taste. Remember that when you grind your own meats, the grinder attachment and bowls must all be completely chilled, and the meat must be trimmed. ‰Û¬‰Û¬Form the patties from chilled meat; this makes it easier to work with. Sear the burgers on a hot grill and serve up with your choice of sides.","video_length":1206,"videoname":"v118","techniques":"saute, grill","difficulty":"medium","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id116"},{"id":117,"title":"Beef Tartare with Capers & Dijon, Beef Carpaccio","description":"Beef Carpaccio can be pounded out or alternately, it may be frozen and thinly sliced. Make sure to remove fat and any of the silver skin that may be on the beef. Use the flat side of a meat mallet to pound the meat thinly. ‰Û¬‰Û¬Short rib can be used to make steak tartare, although the traditional cut is top round. Make sure that the meat used is fresh and trim it of all fat and skin. The knife must be kept sharp; steel when necessary. Remember, you want to taste the meat; there is no need to over-season.","video_length":1061,"videoname":"v119","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id117"},{"id":118,"title":"Veal - Veal Saltimbocca","description":"Veal is extremely tender and cooks quickly. The flavor in this dish is enhanced with salt, applied in the form of prosciutto. Place the meat between two pieces of plastic wrap before pounding it with a meat mallet, season and cook. ‰Û¬‰Û¬Dredging the veal in flour before cooking will cause the outside to crisp up. Don't allow it to burn. Create the sauce in the same pan and plate the veal, topped with the fresh sauce.","video_length":615,"videoname":"v120","techniques":"fry, saute","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id118"},{"id":119,"title":"Veal - Blanquette de Veau","description":"Veal is typically a young tender cut of beef. For purposes of this stew, it is acceptable to use cubed, or stewing veal, which will tenderize during the cooking process. ‰Û¬‰Û¬The vegetables used aid in creation of the stock, and are for flavoring the veal. During the final preparation, a roux will be made to prepare the veloute sauce; be sure to stir constantly to eliminate any lumps.","video_length":819,"videoname":"v121","techniques":"stew","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id119"},{"id":120,"title":"Pan Roasted Rosemary Rack of Lamb","description":"A rack of lamb is typically French-cut for presentation. If it is not, you need to remove and trim extra fat and sinew from the cut of lamb. Locate the loin, use a boning knife to remove the fat from the loin area and expose the bones. ‰Û¬‰Û¬Cast iron is a great pan for searing meat since it holds heat well. Make sure to season the meat liberally and put it in the hot pan until just browned. Smoked rosemary imparts a fantastic flavor and fragrance to this dish.","video_length":935,"videoname":"v122","techniques":"roast","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id120"},{"id":121,"title":"Braised Lamb Shanks with Orzo Salad","description":"Shank of lamb is the cut of meat from the leg to the shoulder. It contains a lot of sinew and makes this a great cut for braising. ‰Û¬‰Û¬Sear the meat prior to braising it in the oven and allow it to cook for a couple of hours. This results in meat that will fall from the bone. Don't be afraid to experiment with various flavorings to change up the dish.","video_length":1206,"videoname":"v123","techniques":"braise, roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id121"},{"id":122,"title":"Butterflied & Stuffed Leg of Lamb","description":"There's no need to be intimidated by the thought of roasting a leg of lamb. Once you've learned to handle it properly you'll be more likely to prepare variations of recipes that use this cut. ‰Û¬‰Û¬Garlic and rosemary are terrific flavor enhancers to lamb. Before you place the lamb in the oven, include a variety of vegetables to be served with the meal. Allow the roast to rest before carving.","video_length":1298,"videoname":"v124","techniques":"roast","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id122"},{"id":123,"title":"Ground Lamb - Shepherds Pie","description":"Freshly ground lamb is the best to use when preparing shepherd's pie. Make sure to use the å? dice to achieve the proper texture, and choice cuts of lamb are not necessary. Be sure that the meat and grinder are thoroughly chilled before using. ‰Û¬‰Û¬Brown the meat and vegetables separately. You'll finish this dish by mixing the vegetables, meat and seasonings together and topping with potatoes, mashed. A splash of beer will add a kick to this comfort dish.","video_length":1091,"videoname":"v125","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id123"},{"id":124,"title":"Sweetbreads - Sauteed Sweetbreads with Capers & Lemon","description":"Sweetbreads typically are from veal and are the thymus gland. It is important that the sweetbreads be soaked in water or milk prior to preparation. This process is called gorging and removes many impurities. ‰Û¬‰Û¬Sweetbreads are extremely versatile and can be prepared in a variety of ways, including poaching, blanching and sautÌ©ing. Serve this specialty dish and experience a surprisingly tasty, velvety-textured offal.","video_length":766,"videoname":"v126","techniques":"saute","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id124"},{"id":125,"title":"Tongue - Grilled Beef Tongue with Fennel, Orange & Peas","description":"Tongue is technically considered meat, yet it is classified as offal. Always scrub the tongue thoroughly before preparing and allow it to soak. Begin preparation in a cold pot, covering the tongue with cold water. ‰Û¬‰Û¬It is necessary to peel the outer layer from the tongue prior to preparing the main dish. Although this is not a popular cut, it is truly tasty. Work with it and you will be pleasantly surprised.","video_length":683,"videoname":"v127","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id125"},{"id":126,"title":"Liver - Calf's Liver with Bacon & Onions","description":"Calf's liver is also known as veal liver, and is the most tender liver to use. It is important to soak the liver in a dish of milk prior to cooking to remove impurities. ‰Û¬‰Û¬Dredge the liver in seasoned flour and place it in a hot, oiled pan. Simply sear the liver; do not overcook it because it will become tough. Complimentary flavors to liver include bacon and onions. Take the time to try this long-time family favorite.","video_length":508,"videoname":"v128","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id126"},{"id":127,"title":"Foie Gras - Seared Foie Gras on French Toast with Pickled Raisins","description":"Fois gras is the French term for the fattened liver of a goose or duck. When working with fois gras, keep it on ice. This offal is graded A, B and C. Grade A is the most prized and has the highest fat content. ‰Û¬‰Û¬There are several ways to prepare this dish. Clean the lobes thoroughly, but do not over-fuss. Fois gras is extremely rich and is complemented with sweet tastes.","video_length":956,"videoname":"v129","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":11,"chef_id":7,"iap_id":"com.topchefu.iap.lesson.id127"},{"id":128,"title":"Fresh Fish 101","description":"Become familiar with different types of fish. When you learn which are dry, oily or delicate you will be able to prepare fish properly and serve the right accompaniments. ‰Û¬‰Û¬Make sure to choose the freshest fish possible. There should be no fishy smell and the gills should be red. Take care as you clean the fish because the fins and tails can be sharp. Finally, to prevent scales from flying everywhere, scale a fish under running water and clean it thoroughly.","video_length":394,"videoname":"v130","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id128"},{"id":129,"title":"Filleting & Skinning Fish","description":"There are two different methods to filleting a fish and it depends on whether you are working with a flat or round fish. Place the raw fish on a paper towel when working with it to prevent it from slipping on the work surface. ‰Û¬‰Û¬After removing the fillets, clean them and remove any small bones that may be on the fillet. A sharp sushi knife or slicer is ideal for removing the skin. The technique is to pull the skin away from the fish, rather than move the knife through the skin. Trim as necessary.","video_length":622,"videoname":"v131","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id129"},{"id":130,"title":"Salmon Filets vs Steak, How to Get Crispy Skin","description":"When preparing grilled salmon steak, it is important to remove extra moisture from the fish and add a bit of oil before placing the fish on the grill. This will ensure that you get a good sear to the meat. Give it some time to caramelize, so that it will not stick to the grill. ‰Û¬‰Û¬To sautÌ© a salmon filet, use a hot pan with a splash of grapeseed oil. This oil has a higher smoke point. Place the seasoned fish skin-side down in the hot pan and be sure to use a spatula to press it down to prevent the fish from curling up.","video_length":838,"videoname":"v132","techniques":"grill, saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id130"},{"id":131,"title":"Steaming - Halibut En Papillote with Lemongrass, Ginger and Lime","description":"To prepare steamed fish in the oven, the fish is placed in a sealed pouch, which can be made from parchment, foil or even cabbage or banana leaves. ‰Û¬‰Û¬When steaming filets, it is important to work with same-sized pieces so that they cook evenly. Add your choice of seasonings and marinade to the pouch, seal and let it steam.","video_length":673,"videoname":"v133","techniques":"steam","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id131"},{"id":132,"title":"Grilling - Grilled Branzino with Spring Ratatouille","description":"There is no need to fear grilling a whole fish. You must choose a firm-fleshed fish, such as branzino, tuna, swordfish or snapper. Make sure your grill is very hot, and along with choosing a firm-fleshed fish, you minimize the possibility of it sticking to the grill. ‰Û¬‰Û¬Season the fish, and just before placing the fish on the grill, drizzle it with a bit of oil. The skin will caramelize and release easily from the grill. Carefully turn the fish and cook the reverse side and you'll serve up a delicious grilled fish, beautiful to serve on a platter along with vegetables.","video_length":925,"videoname":"v134","techniques":"grill","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id132"},{"id":133,"title":"Baking - Salt-Crusted Sea Bass Stuffed with Lemon & Basil","description":"The secret of baking a salt-crusted fish is that the salt-crust seals in the flavors, steams and keeps the fish moist, resulting in an almost roasted flavor. ‰Û¬‰Û¬Season the inside of the fish and prepare the outside with the salt-crust. Be sure to use a fresh, firm-fleshed fish when using this method, and use Kosher salt for the crust.","video_length":936,"videoname":"v135","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id133"},{"id":134,"title":"Frying - Tempura Battered Fish & Chips with Roasted Garlic Aioli","description":"Cod is typically the fish that is fried in batter, but alternately a medium-textured and medium-oily fish works well, such as halibut or Chilean sea bass. ‰Û¬‰Û¬Dust the fish lightly with flour and dip into seasoned batter prior to putting it in the frying pan. Keep the oil at 350 to 375 degrees to achieve a good crunchy outer layer on the fish.","video_length":732,"videoname":"v136","techniques":"fry","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id134"},{"id":135,"title":"Raw - Tuna Tartare with Avocado & Toasted Sesame","description":"Often, when we think of tartare, we think of steak, however this dish can also be prepared with fresh, raw tuna. It is important to use the freshest fish possible, and the fish must be stored properly. Always clean your hands thoroughly before beginning to work with the fish. ‰Û¬‰Û¬Make sure you work with a very sharp knife to avoid tearing the fish, and slice the fish into equal sized pieces. Prepare the flavorful marinade and serve.","video_length":846,"videoname":"v137","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":12,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id135"},{"id":136,"title":"Scallops - Seared Scallops with Caramelized Apple","description":"A bi-valve is a type of shellfish that has two opposing matching shells. such as oysters, clams and scallops. When choosing scallops, make sure that they do not have a strong aroma; rather, they should smell fresh, and it is best to work with dry-packed scallops. ‰Û¬‰Û¬Be careful when shucking the scallop. Remove the roe and discard it, and remove the tiny muscle from the scallop as this can ruin the cooked dish. Finally, allow them to sear in the pan, but don't allow them to overcook because they will become rubbery.","video_length":934,"videoname":"v138","techniques":"saute","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id136"},{"id":137,"title":"Oysters - Baked Oysters with Bacon Aioli","description":"An oyster is another type of shellfish that is considered a bi-valve, due to the two opposing matching shells. The natural flavor varies greatly depending on the location where the oysters are harvested - whether from the East or West coast. ‰Û¬‰Û¬Oysters harvested during the months of September through April tend to be better because of the cooler waters. When preparing oysters it is important to clean the outer shell with a small brush to make sure all grit is removed. Be careful during the shucking process, and simply serve them raw on a bed of ice with classic condiments.","video_length":970,"videoname":"v139","techniques":"bake, roast","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id137"},{"id":138,"title":"Mussels - Mussels Escabeche","description":"Mussels are considered bi-valves because they are two shells, connected by a hinge. There are a variety of mussels available and they have different tastes. It's important that the mussels are fresh, and alive before you cook them. Perform the tap test to determine if it is alive; if it is not, do not use it because it will spoil your dish. ‰Û¬‰Û¬The shells will pop open as they are being cooked. After steaming, remove them from the shell and they're ready for your recipe. With flavor and seasonings added, you'll have a delicious rich dish.","video_length":973,"videoname":"v140","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id138"},{"id":139,"title":"Clams - Asian Clams with Black Bean Sauce","description":"Cherry-stone clams are a medium-sized clam. Buy them fresh and alive. Don't seal the bag and store them on ice until you are ready to prepare them. Clean the shells with a brush under running water to remove dirt on the shells. ‰Û¬‰Û¬Allow the clams to steam thoroughly with liquid and seasonings and they will open by themselves, ready to serve.","video_length":618,"videoname":"v141","techniques":"steam","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id139"},{"id":140,"title":"Shrimp 101 - Garlic Shrimp Scampi","description":"Shrimp are considered crustaceans because of their limbs. There are several varieties available and as you become familiar to the different types, you'll be able to choose the best fresh shrimp for your dish. ‰Û¬‰Û¬As with all seafood, it's important that you select the freshest available and with shrimp, and you must understand the sizing of them. Clean and de-vein them properly for the best presentation and taste.","video_length":798,"videoname":"v142","techniques":"saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id140"},{"id":141,"title":"Crab - Dungeness Crab Cakes with Sambal Aioli","description":"The East and West coasts provide a variety of crabs, and of course Alaska is known for King Crab. The crab should be alive when purchased; this indicates freshness. Allow about 12 minutes for the crab to cook in boiling water. ‰Û¬‰Û¬Cool the crab in the refrigerator until you are able to handle it, crack and remove the shell and get the crab meat ready for your recipe.","video_length":1091,"videoname":"v143","techniques":"saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id141"},{"id":142,"title":"Lobster - Fresh Baked Lobster with Garlic-Panko Breadcrumbs","description":"Maine lobster is the most familiar of the lobster varieties. Be sure to purchase the lobster alive. An alternate way of preparing it for cooking is to freeze it before splitting it and cleaning it thoroughly. ‰Û¬‰Û¬It is assumed that lobsters are typically boiled alive, but this is not necessary. Another method of preparation is steaming or broiling and these methods maintain more of the succulent flavor, which is complemented with lemon and butter.","video_length":523,"videoname":"v144","techniques":"bake, broil, roast","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":13,"chef_id":1,"iap_id":"com.topchefu.iap.lesson.id142"},{"id":143,"title":"Introduction to Pasta - Fresh vs Dry, Shapes","description":"Dry pasta stores longer than fresh because it is made without eggs, and is a great staple to your pantry. Both types are available in a variety of shapes and can be served with sauce, or shaped pasta may be stuffed with fillings of meat, cheese or vegetables. ‰Û¬‰Û¬Couscous and orzo are also part of the pasta family, although they are often mistaken for grains. Remember to cook pasta to the point where it is a little firm to the bite, in Italy, this is \"al dente.\"","video_length":243,"videoname":"v145","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id143"},{"id":144,"title":"Fresh Pasta Dough - \"1-2-3\" Recipe","description":"Preparing fresh pasta is quick and simple. Minimal ingredients consisting of oil, flour, eggs and salt result in maximum flavor. The eggs must be at room temperature when incorporating them into the flour. ‰Û¬‰Û¬Dough must be chilled before processing. Roll by hand or use a pasta machine. Dust the dough with flour as it is being processed, and allow the pasta to dry for ten to fifteen minutes before cooking.","video_length":505,"videoname":"v146","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id144"},{"id":145,"title":"Tomato Sauce - Spaghetti with Fresh Basil & Parmesan","description":"Use fresh ingredients to make a great pasta sauce. A heavy-bottomed pan is ideal for heating grapeseed or canola oil before adding onions. Canned or fresh tomatoes may be used, and the onions should be cooked to translucency, not browned. ‰Û¬‰Û¬Add dry herbs while cooking, but if using fresh herbs, add them at the very end. Simmer, serve and plate the perfect pasta.","video_length":531,"videoname":"v147","techniques":"boil, saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id145"},{"id":146,"title":"Meat Sauce - Tagliatelle Bolognese","description":"Create a great Bolognese by combining a variety of meats: diced pancetta, ground pork, beef and veal. This combination of meat, added to herbs, vegetables, tomatoes and liquids creates a rich and hearty sauce. ‰Û¬‰Û¬When serving a heavier sauce such as Bolognese, suggested pasta is tagliatellle or a long, wide, ribbon pasta, cooked al dente.","video_length":843,"videoname":"v148","techniques":"boil, stew","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id146"},{"id":147,"title":"Fettucine Carbonara","description":"Creating a Carbonara sauce is quick and easy, and requires only a few ingredients. Pancetta provides the main flavor, and is complemented by garlic and pepper. ‰Û¬‰Û¬Eggs should be fresh and at room temperature when adding to the tossed Fettuccine and pancetta mixture. Plate and serve topped with freshly grated Parmesan, pepper and parsley.","video_length":462,"videoname":"v149","techniques":"boil, saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id147"},{"id":148,"title":"Cream Sauce - Penne with Sweet Peas and Prosciutto","description":"Alfredo sauce is cream-based and rich. It can be served plain, or enhanced by prosciutto and peas, as in the dish prepared in this lesson. Add a little zest of lemon, and a bit of mint, which will brighten the taste of this sauce. ‰Û¬‰Û¬Cook the penne until it reaches al dente and strain but do not rinse. Plate the dish, serve with the sauce and garnish with a little more finely-chopped mint, salt and pepper, grated cheese and prosciutto.","video_length":432,"videoname":"v150","techniques":"boil, saute","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id148"},{"id":149,"title":"Linguine with Spicy Clams & White Wine","description":"When sautÌ©ing the base ingredients for any sauce, it is best to use grapeseed or canola oil, because of the higher smoke point. Make sure your skillet is very hot before adding vegetables and meat. ‰Û¬‰Û¬Clams must be fresh and still alive, and they will quickly cook in their shells, in the sautÌ© pan. Cook the linguini al dente, and top with the delicious sauce and fresh clams.","video_length":443,"videoname":"v151","techniques":"boil, saute","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id149"},{"id":150,"title":"Baked Pasta - Vegetarian Lasagna","description":"Either fresh or dry pasta sheets may be used in a lasagna dish, but there's nothing like freshly made pasta. Roughly chop vegetables of your choice and roast them for a truly intense flavor in this dish. ‰Û¬‰Û¬Lasagna is a layered dish; use the roasted vegetables along with additional sautÌ©ed vegetables and prepare a mixture of cheeses. Have your fillings ready when you put the dish together. A great tip is to use a large, flat pan to cook the noodles rather than a pot; this way you will avoid tearing them.","video_length":960,"videoname":"v152","techniques":"boil, bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id150"},{"id":151,"title":"Stuffed Pasta - Duck Confit Ravioli","description":"Use a hot sautÌ© pan to prepare the filling for ravioli. Use the duck jus to deglaze the pan and reserve some of it for the finishing sauce. ‰Û¬‰Û¬Preparing fresh ravioli is a little time-consuming, but the rewards are tremendous. Use a little patience and a lot of restraint. Avoid overstuffing these pasta pillows. Finally, allow them to cook in boiling water for two to three minutes, or until they are opaque and start to float. Top with sauce and a sprinkle of Parmesan and enjoy.","video_length":1000,"videoname":"v153","techniques":"boil, saute","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id151"},{"id":152,"title":"Rolled Pasta - Potato Gnocchi with Creamy Gorgonzola","description":"Potato is the base for this little Italian dumpling. Prepared correctly it is a light, fluffy and satisfying dish. ‰Û¬‰Û¬After rolling and cutting the dough, press down on each individual dumpling with the back of a fork to create ridges. These ridges will help the sauce stick to the gnocchi. Top with marinara or cream sauce, such as this gorgonzola and garnish as desired.","video_length":866,"videoname":"v154","techniques":"boil, saute","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":14,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id152"},{"id":153,"title":"Introduction to Grains - what they are and how to prepare them","description":"Grains are a necessary and healthy part of the diet. A variety of grains are available and easy to incorporate into meals. Rice is a commonly used grain, but there are other grains including grits, polenta, wheat berries, bulgur and quinoa. ‰Û¬‰Û¬Grains may be cooked by using the absorption method, boiling, or in pilafs. Incorporate grains into your diet and add a super-food that can reduce the risk of heart disease and regulate blood glucose.","video_length":283,"videoname":"v155","techniques":"technique","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id153"},{"id":154,"title":"Perfect Steamed White Rice","description":"To cook basic white rice you must first rinse the rice thoroughly, until the water runs clear. This removes the excess starch and helps keep the grains separate, light and fluffy. When steaming rice, a general ratio of rice to water is about 1-part-rice to just under 2-parts-water.\nAdd rice to boiling water, lower the heat and simmer for 17 to 20 minutes and do not open the lid. Fluff up the cooked rice and serve.","video_length":269,"videoname":"v156","techniques":"steam","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id154"},{"id":155,"title":"Risotto 101 - Wild Mushroom Risotto","description":"A strong mushroom such as porcini, will add greatly to the flavor of mushroom risotto. Risotto is a rice dish and Arborio rice is the grain used. Although there are minimal ingredients, it is important to take the time to prepare it properly to achieve the correct taste and texture. ‰Û¬‰Û¬Pour hot stock into hot risotto, this way you avoid a gummy texture. The rice should be a little bit runny, yet each grain should have a firm bite. This dish is well worth the effort.","video_length":639,"videoname":"v157","techniques":"saute, steam","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id155"},{"id":156,"title":"Pilaf - Brown Rice Pilaf with Dried Cranberries & Toasted Almonds","description":"Pilaf uses two cooking methods: the absorption method and the risotto method, which requires toasting the grains of rice prior to boiling and steaming. ‰Û¬‰Û¬Stock or water can be used, although stock provides much more flavor. For the finishing touch, add extra ingredients to the fluffed rice and serve as a tasty side dish.","video_length":387,"videoname":"v158","techniques":"steam","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id156"},{"id":157,"title":"Creamy Grits with Shrimp & Sausage","description":"Shrimp and grits are a Southern staple, and the grits are coarsely-ground cornmeal cooked with liquid. This results in a porridge that is the perfect accompaniment to sides such as shrimp and sausage. ‰Û¬‰Û¬Grits may be cooked with milk, cream, stock or water. Enhance the flavor by adding a little butter for richness, or cheese if desired.","video_length":524,"videoname":"v159","techniques":"boil, steam","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id157"},{"id":158,"title":"Barley - Comforting Beef & Barley Soup","description":"Pearl barley works perfectly with a beef stew. Beef shoulder or shanks can be used in preparation of the stew, and should be browned before adding other ingredients and liquids for better flavor. ‰Û¬‰Û¬Timing is important. Be sure to rinse the pearl barley under cold water before cooking. Although barley may appear to be a strong little grain, it can be overcooked, and this will ruin the perfect texture, so add the barley and tomatoes during the last 45 minutes of cooking.","video_length":550,"videoname":"v160","techniques":"boil","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id158"},{"id":159,"title":"Bulgur - Toasted Bulgur Wheat Salad","description":"Toasting dry bulgur in a dry skillet brings out the natural nutty flavor. It only requires a minute or two; be sure not to burn this little grain. ‰Û¬‰Û¬Add moist ingredients or liquid and cover for 15 minutes. The bulgur absorbs the moisture and is ready for additional ingredients, dressing and garnish.","video_length":672,"videoname":"v161","techniques":"boil, steam","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id159"},{"id":160,"title":"Quinoa - Stuffed Poblano Peppers with Queso Fresco","description":"Remember it's pronounced \"keen-wah.\" This delicate grain is perfect as a base for stuffing other vegetables such as tomatoes, peppers, or this case, a mild poblano pepper. ‰Û¬‰Û¬Dry toasting the quinoa brings out the nutty flavor of the grain. It should only be toasted to a golden brown, not dark. Add liquids and simmer for 3 to 4 minutes. Other vegetables may be added to provide a delicious, tasty stuffing.","video_length":550,"videoname":"v162","techniques":"boil, bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id160"},{"id":161,"title":"Introduction to Bread Baking - Pain De Mie","description":"Pain de mie is a basic white bread dough recipe. Having the skills to make basic bread allows you to create a variety of dough used in other recipes. Yeast must be activated with room temperature water, between 105F and 115F. It can be destroyed if the temperature is too cold or too hot, so an instant read thermometer is recommended. ‰Û¬‰Û¬Kneading the dough develops gluten which gives structure to the bread. It is important to work the dough, then let it rise in a warm dry place before baking.","video_length":531,"videoname":"v163","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id161"},{"id":162,"title":"Rosemary Garlic Focaccia","description":"Focaccia can be topped with a variety of herbs, spices and vegetables. Yeast is the active ingredient and an instant read thermometer can be used to get water to the proper temperature for the yeast. ‰Û¬‰Û¬Knead the dough and rub oil on it prior to allowing it to rest and rise. It should double in volume. Right before placing the dough in the oven, use a liberal amount of olive oil on the top and add the seasonings of your choice. Have patience while making this classic Italian bread, it has a savory taste and is perfect on your table.","video_length":655,"videoname":"v164","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id162"},{"id":163,"title":"Parker House Rolls","description":"This classic roll is a great addition to your family dinner. Note that the recipe calls for 50/50 bread flour and regular flour. This creates the special consistency of these rolls. ‰Û¬‰Û¬Although it is a bit of a lengthy process, it is important to allow time to knead the dough and let it rest properly to achieve a light, fluffy roll. The freshly baked rolls can be torn apart and all they need is a little butter.","video_length":542,"videoname":"v165","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id163"},{"id":164,"title":"Buttery Brioche Loaf","description":"Brioche is very rich and buttery although during preparation the batter may look dry. Use an electric mixer to incorporate the ingredients. The dough will be ready when it forms a ball. ‰Û¬‰Û¬As with any bread dough, you must take the time to knead the dough and let it rest, and this dough must be chilled in the refrigerator before being formed and finally baked for a fantastic French treat.","video_length":564,"videoname":"v166","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":15,"chef_id":2,"iap_id":"com.topchefu.iap.lesson.id164"},{"id":165,"title":"Compotes and Poached Fruit","description":"Fruit compote is a delicious, simple dessert. It begins with simple syrup - the building block for many desserts. To make a simple syrup, simply melt equal parts sugar and water together on low heat. ‰Û¬‰Û¬Infuse your syrup with the flavors of your choices. When you add your poached fruit, you can either choose to peel the fruit or not. In some instances, an un-peeled fruit maintains its integrity. Choose fruit that isn't too ripe - otherwise it may turn to mush. ‰Û¬‰Û¬Remember, a combination of sugar, acid (in the form of lemon zest) and salt really bring the fruit flavors out.","video_length":1095,"videoname":"v167","techniques":"boil","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id165"},{"id":166,"title":"Pate A Choux - Chocolate Profiteroles","description":"Pate a choux is a light dough made on the stove top. It requires no rolling or kneading, and it's the foundation for many classic desserts - including cream puffs, which is pate a choux with whipped or pastry cream in the middle, or profiteroles, which is pate a choux filled with ice cream. ‰Û¬‰Û¬Once you've mastered pate a choux, you can also use it to make eclairs, beignets, gougers and croquembouches.","video_length":1291,"videoname":"v168","techniques":"bake","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id166"},{"id":167,"title":"Chewy Oatmeal Raisin Cookies","description":"In this course, you're making more than cookies - you're also learning good basic baking principles. Here are some highlights: ‰Û¬‰Û¬Always cream your butter at room temperature. Do not over-whip the butter - you'll lose the air you've worked so hard to incorporate. ‰Û¬‰Û¬Always combine wet ingredients with wet ingredients first. Then fold that mixture into your combined dry ingredients. Once more, everything should be at room temperature. ‰Û¬‰Û¬Crack eggs into a separate container before adding to the overall mixture. That way if an egg is bad you haven't ruined all of your ingredients. ‰Û¬‰Û¬Remember to only mix until ingredients are combined. Over-mixing makes tough cookies. ‰Û¬‰Û¬Finally, remember to give your cookies space on the baking tray. They'll spread out as they cook.","video_length":778,"videoname":"v169","techniques":"bake","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id167"},{"id":168,"title":"Pecan Double Chocolate Brownies","description":"Brownies are flat, baked bars that differ from cookies because they're not individually baked. Brownies can be made either fudgy or cakey - or in a way that pleases both preferences. ‰Û¬‰Û¬For ease of cutting, prep your baking pan with a coat of butter, then criss-cross two strips of parchment paper inside. ‰Û¬‰Û¬To test for doneness, look for a shiny top and edges that have pulled away from the sides of the pan. You can also insert a skewer or cake tester - if it comes out clean, they're ready to come out of the oven. When finished, simply lift out by the edges of the criss-crossed parchment, slice and serve.","video_length":884,"videoname":"v170","techniques":"bake","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id168"},{"id":169,"title":"Cranberry and Almond Biscotti","description":"The term \"biscotti\" comes from the Italian language, and it actually means \"twice cooked.\" That's the fundamental difference with this unique pastry. ‰Û¬‰Û¬These cookies are hard, dry, and designed for dunking in coffee, tea or wine. ‰Û¬‰Û¬If you're using dried fruit in your biscotti, remember to re-hydrate it (you will be cooking it twice, after all). ‰Û¬‰Û¬Biscotti can be stored in an airtight container for a couple of weeks.","video_length":853,"videoname":"v171","techniques":"bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id169"},{"id":170,"title":"Tuiles","description":"Tuiles are a delicate, paper-thin cookie often bent into fanciful shapes. They're fairly simple to master - if you're willing to practice. ‰Û¬‰Û¬Whipping your egg whites appropriately is essential. Remember, you don't want too much air - otherwise it's too much like a meringue. ‰Û¬‰Û¬Drop the batter far apart on the tray. These cookies will need to spread out. You're looking for 1/8-inch thickness. ‰Û¬‰Û¬Watch your cookies carefully as they bake. They cook very quickly. Shape them immediately after you take them out of the oven. Be careful and quick and you'll achieve just the results you want. And if you choose, you always get a do-over: just pop them back in the oven so they're malleable again.","video_length":789,"videoname":"v172","techniques":"bake","difficulty":"difficult","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id170"},{"id":171,"title":"Cakes I - Classic Yellow Cake","description":"This yellow cake lesson contains tips you'll use for just about any cake. Here are the highlights: ‰Û¬‰Û¬Cream butter and sugar correctly - remember, room temperature on your butter. Plan ahead to make sure your butter's at the right temp. When whipping, look for a pale yellow color. Whipping beyond that will cause the butter to collapse. ‰Û¬‰Û¬A combination of cake flour and regular flour gives the cake both body and lightness. ‰Û¬‰Û¬Remember, butter and flour the edges and bottom of your pan thoroughly. That way you can pop it from the pan with ease when it's done.","video_length":1219,"videoname":"v173","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id171"},{"id":172,"title":"Cakes II - Flourless Chocolate Cake","description":"Instead of flour, whipped egg whites give this cake its lift and rise. Here are a few tips: ‰Û¬‰Û¬Remember, when melting chocolate, don't let it get too hot. You don't want it to cook the egg yolks when they're added later. ‰Û¬‰Û¬Add ingredients gradually - especially when combining with egg whites. Dumping ingredients suddenly will deflate your whites.","video_length":982,"videoname":"v174","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id172"},{"id":173,"title":"Apple Tarte with Scented Caramel Sauce","description":"This is a classic dessert of apples caramelized in butter and sugar - then baked with puff pastry in the oven. ‰Û¬‰Û¬A great apple tarte tatin starts with the right apples - we suggest Granny Smith or Romas. Keep the apples from oxidizing by placing the peeled fruit in a tub of water with lemon juice. ‰Û¬‰Û¬This recipe happens in a few parts - making caramel, preparing the apples and making your puff pastry.","video_length":1112,"videoname":"v175","techniques":"bake, saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id173"},{"id":174,"title":"Pate Sucre - Summer Berry Tart","description":"The basis of this recipe is what's called a \"pate sucre\" - a basic sweet crust that is delicate with a light snap. This dough is made in a fruit processor since it doesn't rely so much on the incorporation of air. ‰Û¬‰Û¬You'll know the dough is ready when you pinch a piece of it together and it holds instead of falling apart. Roll it out until it's 2-3 inches wider than your tart pan. Another good trick is to roll the dough around your pin to transfer it to the pan. ‰Û¬‰Û¬Here, we also introduce you the concept of blind baking - that's another term for baking a shell by itself.","video_length":1386,"videoname":"v176","techniques":"bake","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id174"},{"id":175,"title":"Pate Brisee - Pumpkin Pie","description":"In this recipe, you're introduced to pate brisee - a more crumbly crust that uses less sugar than the pate sucre. That's what makes it perfect for pies. You can make your pate brisee in a food processor or by hand -- it's up to you. ‰Û¬‰Û¬For dough like this (biscuit and pie dough), a huge part of your success relies on how well you cut the butter into flour. This involves cutting the butter into small pieces so that when they melt, it makes a light, flakey crust. Instead of creaming the butter, you work the whole pieces into it. ‰Û¬‰Û¬Important tips to remember: work quickly, work with cold butter and don't overwork the flour.","video_length":788,"videoname":"v177","techniques":"bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id175"},{"id":176,"title":"Cooked Custard - CrÌ¬me Brulee","description":"CrÌ¬me Brulee is a classic - and relatively easy to prepare. Here's a good tip: add some of the recipe's sugar to the bottom of the pan with cream to help keep the bottom from scorching. ‰Û¬‰Û¬Remember to combine your egg mixture and hot cream together a little at a time so the eggs don't curdle. The water bath in the oven keeps your custards from cracking or becoming rubbery. ‰Û¬‰Û¬This dessert is sort of a blank canvas...you can add orange peel, almond extract, coconut or pistachios to drastically change the flavor profile.","video_length":474,"videoname":"v178","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id176"},{"id":177,"title":"Vanilla-Orange Panna Cotta","description":"Panna Cotta is another simple classic. Translated from Italian, \"panna cotta\" literally means \"cooked cream.\" It's just that - simply simmer cream and sugar together, then mix with gelatin and cool until set. ‰Û¬‰Û¬This is a subtle dessert, so you'll be using much less sugar. An infusion of vanilla is another great addition. When you add the orange, you'll infuse with whole strips of zest rather than grated zest. That way you can remove it later, preserving the creamy texture. This is also why it's important to strain your mixture through a sieve.","video_length":611,"videoname":"v179","techniques":"bake","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id177"},{"id":178,"title":"Meringues with Dried Cherry Compote","description":"Meringues are basically made from egg whites and sugars. They're crispy on the outside and marshmallow-soft on the inside. Here are the different types: ‰Û¬‰Û¬Italian Meringue - sugar is cooked to 238 degrees F and then poured down the side of a bowl while whisking in egg whites. This is the most stable meringue. ‰Û¬‰Û¬Swiss Meringue - egg whites and sugar are whisked over a double boiler, then beaten away from the heat until firm and glossy. ‰Û¬‰Û¬French Meringue - egg whites and sugar are whisked together with a stabilizer until stiff peaks form. This is the easiest of the meringues - and it's the one we use for mini pavlovas.","video_length":730,"videoname":"v180","techniques":"bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id178"},{"id":179,"title":"Chocolate Mousse presented 2-ways","description":"There are many different types of mousse, but chocolate is the simplest. The key: use high quality chocolate. ‰Û¬‰Û¬The complete method is located on the recipe tab. Once you've mastered the basics, try adding different flavors such as Grand Marnier, vanilla, whiskey or even chili.","video_length":870,"videoname":"v181","techniques":"bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id179"},{"id":180,"title":"Classic French Souffle","description":"The key to a great souffle: timing. You'll also want to make sure your cups are clean and dry, and buttered thoroughly all the way around. That way you'll get a souffle that rises well and doesn't stick. Place your vessels in the fridge after they're prepped. ‰Û¬‰Û¬Once your batter is prepped, work quickly - it's a temperamental batter, and you'll lose air if you delay. True to its nature, you'll want to serve this one immediately. This is a dish that demands your undivided attention.","video_length":600,"videoname":"v182","techniques":"bake","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id180"},{"id":181,"title":"Strawberry-Mascarpone Semifreddo with Cilantro & Lime","description":"Translated from the Italian, semifreddo literally means \"half cold.\" That puts it in a category of dessert that's much like ice cream. ‰Û¬‰Û¬One tip: Macerating your strawberries will intensify their flavor. Additionally, remember that you don't want to stir the strawberries into the custard base - a gentle folding will give you a nice swirl instead.","video_length":966,"videoname":"v184","techniques":"bake","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id181"},{"id":182,"title":"Watermelon Sorbet, Summer Citrus Granita","description":"Granitas and sorbets are fairly similar: both are basically made up of fruity flavored ingredients, sugar, water, and some time in the freezer. ‰Û¬‰Û¬A granita is essentially frozen fruit juice and sugar shaved into delicate crystals. A sorbet, on the other hand, takes those same ingredients and then combines them in an ice cream machine for a smoother texture.","video_length":631,"videoname":"v185","techniques":"bake","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":16,"chef_id":3,"iap_id":"com.topchefu.iap.lesson.id182"},{"id":183,"title":"Crab and Shrimp Potstickers","description":"Potstickers are named for their remarkably sticky wrappers. These ancient dumplings are both steamed and fried. ‰Û¬‰Û¬Be sure to get the freshest shrimp you can. Frozen shrimp is just fine if that's all you have available. For crab, look for fresh-frozen, though canned is acceptable in a pinch. As always, keep your seafood iced down or in the fridge until the moment you're about to use it. ‰Û¬‰Û¬Remember to use white pepper - it's always a good mild choice for seafood. ‰Û¬‰Û¬For frying, use peanut oil. Be gentle with the potstickers before frying - listen for a light sizzle. If you're using a non-stick pan, use a rubber spatula. In our recipe, you'll steam the potstickers with chicken stock.","video_length":1030,"videoname":"v186","techniques":"steam, saute","difficulty":"difficult","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id183"},{"id":184,"title":"Peking Duck, Pancakes, Potstickers","description":"Crispy skin is the key to a perfect Peking Duck. Boiling the duck in highly salted water is essential - followed by a dry brine. Once the duck dries overnight (uncovered) in the fridge, you've prepped for the perfect skin. ‰Û¬‰Û¬We've paired our duck with pancakes, cucumber salad and hoisin sauce. For the sauce, be sure to whisk in some of the duck fat from your cooked duck.","video_length":800,"videoname":"v187","techniques":"roast","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id184"},{"id":185,"title":"Shrimp & Egg Fried Rice","description":"Fried rice exemplifies one of the basic tenets of wok cooking: incredibly high heat cooking food really, really fast. ‰Û¬‰Û¬As always, fresh shrimp is best, but frozen will do in a pinch. SautÌ© your shrimp until they turn pink - that's how you'll know they're done. For traditional Chinese rice, season with salt...for a flavorful update, use soy sauce instead.","video_length":468,"videoname":"v188","techniques":"saute","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id185"},{"id":186,"title":"Chutneys & Raitas","description":"Chutney is a popular condiment used all across India, with flavors ranging from spicy to sweet to savory, tangy and sour. ‰Û¬‰Û¬Raita is another popular condiment. This one's yogurt-based and served chilled. ‰Û¬‰Û¬You don't have to limit these condiments to Indian food - try them on any type of cuisine.","video_length":1202,"videoname":"v189","techniques":"saute","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id186"},{"id":187,"title":"Chicken and Chickpea Samosas","description":"Samosas are a fried delicacy that can be filled with anything - meat, fish, poultry or veggies. ‰Û¬‰Û¬When making your own samosa dough, be sure to break up all the ghee. Just be careful not to over-mix the dough...you don't want to over-heat it with your hands. ‰Û¬‰Û¬After your dough is prepared and properly refrigerated, you're ready to shape and stuff your samosas. Here's a tip: be careful not to over-stuff. If you do, the samosa will break apart while you're deep-frying it. You'll also want to fry in batches so you don't overcrowd the pot and cool down the oil.","video_length":631,"videoname":"v190","techniques":"fry","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id187"},{"id":188,"title":"Lamb Vindaloo with Pulao Rice","description":"Vindaloo is a spicy meat and potato stew that's marinated for several days. We've chosen lamb for our dish because of its robust flavor. ‰Û¬‰Û¬To complement the vindaloo, we've prepared pulao rice. Use Basmati rice for this dish - the delicate, long grains are perfect.","video_length":744,"videoname":"v191","techniques":"stew","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id188"},{"id":189,"title":"Spanish Tapas","description":"Tapas are small dishes with big flavors. They've become wildly popular as a perfect pairing with wine and cocktails. For our course, we're cooking up poached Spanish olives, Spanish garlic shrimp, crunchy tomato bread and a selection of Spanish cheeses. ‰Û¬‰Û¬Regional elements are important. For the shrimp, you'll be using espelette pepper - an ingredient from the Basque area bordering France. For your cheeses, look for the Denomination of Origin stamp that certifies the authenticity of each variety.","video_length":697,"videoname":"v192","techniques":"fry, bake, roast, saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id189"},{"id":190,"title":"Hosea's Paella","description":"The Spanish paella is a one-pot dish with many traditional ingredients. It can contain virtually anything; we've made ours with chicken, chorizo, shrimp, peppers, and scallions. As with all one-pot cooking, it's important to build the flavors as you go. ‰Û¬‰Û¬One note: You'll need a traditional paella pan to really bring this one off to perfection.","video_length":531,"videoname":"v193","techniques":"saute, bake","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id190"},{"id":191,"title":"CrÌ¬me Caramel","description":"CrÌ¬me Caramel is another term for flan or caramel custard. It's a dessert that you see often in Mexican cuisine as well. ‰Û¬‰Û¬For the full method, see the recipe tab. Once you've mastered the basics, then feel free to experiment - you can explore even more bold flavors by infusing your crÌ¬me caramel with lavender or almond extract.","video_length":462,"videoname":"v194","techniques":"bake","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":17,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id191"},{"id":192,"title":"Fresh Guacamole & Roasted Tomatillo Salsa","description":"For fresh, homemade guacamole and salsa, fresh ingredients are the key. ‰Û¬‰Û¬For our salsa, we're introducing you to tomatillos - often confused with a green tomato, it's got a tart and crisp flavor that's a great accompaniment to Mexican cuisine, which can sometimes be heavy. ‰Û¬‰Û¬For guacamole, you'll want avocados at the peak of ripeness. Give them a slight squeeze - if they give a little, they're just right.","video_length":873,"videoname":"v195","techniques":"raw","difficulty":"easy","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id192"},{"id":193,"title":"Scallop Ceviche with Crispy Plantains","description":"Ceviche is quintessential Mexican cuisine: fresh, simple and delicious. Though our recipe uses scallops, it can also be made with shrimp or whitefish. Go with something fresh and seasonal. ‰Û¬‰Û¬To check for doneness, look for fish that is white and scallops that are no longer translucent. At this point, it means the acids have fully cooked the products. ‰Û¬‰Û¬For fried plantains, select some that are still a bit green - the higher starch content yields better results for fried foods.","video_length":788,"videoname":"v196","techniques":"raw","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id193"},{"id":194,"title":"Baja Fish Tacos, Fresh Tomato Salsa, Chipotle Mayonnaise","description":"For Baja fish tacos, reference the recipe tab to see the full method and ingredients list. ‰Û¬‰Û¬By way of helpful tips: always use flakey whitefish - preferably fresh instead of frozen. And when it comes to putting together your ingredients for your tomato salsa, remember that fresher is better, too.","video_length":736,"videoname":"v197","techniques":"fry","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id194"},{"id":195,"title":"Coconut Green Curry Mussels","description":"For our recipe, we've used green mussels from New Zealand. If these aren't available, any fresh mussel will do. ‰Û¬‰Û¬As always, be sure to discard any mussels that don't open during steaming. Also, be sure not to over-crowd your mussels in the skillet so they have room to open. They don't take long to cook - as soon as they start to open, they're done. ‰Û¬‰Û¬For your fresh ingredients, you'll find most of them near the root section of your local grocery store.","video_length":583,"videoname":"v198","techniques":"steam","difficulty":"easy","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id195"},{"id":196,"title":"Chicken & Shrimp Pad Thai","description":"Pad Thai is the national dish of Thailand. Made up of stir-fried rice noodles, eggs, fish sauce, tamarind juice, red chili pepper, plus bean sprouts and any combination of shrimp, chicken or tofu. ‰Û¬‰Û¬For this recipe, the wok is the only way to go - that way you get the hot, quick cooking this dish requires.","video_length":590,"videoname":"v199","techniques":"saute","difficulty":"medium","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id196"},{"id":197,"title":"Whole Fried Fish with Tamarind Sauce","description":"For this recipe, you'll wok-fry an entire fish. It's a dramatic - and delicious - dish. ‰Û¬‰Û¬You've already learned how to prep a whole fish in another lesson. Here are some additional tips: Remember to season the fish inside and out. Score the flesh of the fish with your knife, right down to the bone, on both sides. When putting your fish in the hot oil in the wok, slide it in tail first, slowly. Do not drop the fish in - you could get burned by the splattering hot oil. ‰Û¬‰Û¬Keep some extra oil on hand in case you need more to completely cover the fish. This is recommended instead of risking over-filling your wok. If the oil spills, you've got a real fire hazard on your hands. ‰Û¬‰Û¬When preparing your sauce, sautÌ© the chilies in fish oil from your wok for added flavor.","video_length":724,"videoname":"v200","techniques":"fry","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id197"},{"id":198,"title":"Crispy Potato Cakes with Apple Sauce","description":"Like so many recipes, a great potato cake is deceptively simple. But with practice, you'll master them in no time. Here are some hints to help you along: ‰Û¬‰Û¬Use a nice, starchy potato, like a Russet. Don't rinse your grated potato if you're cooking the right away - you want all that starch on there. Just squeeze out the excess moisture in a colander. ‰Û¬‰Û¬An immersion blender works best for your applesauce - that way you can blend the hot apple mixture right in the sautÌ© pot.","video_length":814,"videoname":"v201","techniques":"saute, fry","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id198"},{"id":199,"title":"Wild Mushroom and Rabbit Spaetzle","description":"This is a very rustic, traditional dish. The full method is in the recipe tab, but here are some helpful hints. ‰Û¬‰Û¬Make sure your rabbit loins are dry before searing - pat them with a towel if you need to. The meat is small, so it's going to cook fast - make sure you get good caramelization with a good hot pan. As always, give the meat room in the pan so it sears instead of steams. ‰Û¬‰Û¬Spaetzle is basically German pasta. The fresh dough is quick and fairly easy to make. Push the dough through a colander or potato ricer and into boiling water for the ideal shape. Remember, a larger pasta will take longer to cook.","video_length":851,"videoname":"v202","techniques":"boil, saute","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id199"},{"id":200,"title":"Wiener Schnitzel with Cranberry Chutney","description":"Wiener Schnitzel is actually a breaded veal cutlet. It's a traditional German favorite - and we give ours a special twist with some cranberry chutney. ‰Û¬‰Û¬For the full method, refer to the recipe tab.","video_length":749,"videoname":"v203","techniques":"saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":18,"chef_id":8,"iap_id":"com.topchefu.iap.lesson.id200"},{"id":201,"title":"Gravlax on Pumpernickel with Quick Pickled Red Onion","description":"Gravlax is a cured salmon dish that originates in Scandinavia. ‰Û¬‰Û¬Your most essential element is a piece of great fish. Make sure your salmon is fresh - smell it (it shouldn't smell overly fishy - more like ocean or cucumber) and handle it (it should be nice and firm). The color should be a healthy pink and the flesh should be nice and shiny. ‰Û¬‰Û¬Plan ahead - remember, you'll be curing this dish in your refrigerator for two days. Just keep your fridge below 35 degrees - 32 is ideal.","video_length":1280,"videoname":"v204","techniques":"raw, saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id201"},{"id":202,"title":"Buckwheat Blinis with CrÌ¬me Fraiche & Caviar","description":"This is a simple dish that just requires a couple steps. Blinis are basically pancakes - and the buckwheat gives them some extra flair. As with pancakes and crepes, remember to combine your wet and dry ingredients separately. ‰Û¬‰Û¬For caviar, choose one that fits your budget - ideally, select something wild and unpasteurized.","video_length":1460,"videoname":"v205","techniques":"saute","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id202"},{"id":203,"title":"Saffron Arancini Stuffed with Manchego & Quince","description":"Translated from the Italian, \"arancini\" means \"little fried rice balls.\" That's exactly what this elegant little hors d'oeuvre is - and we've given ours a Spanish twist. ‰Û¬‰Û¬For your risotto, we recommend using arborio rice - its high starch will make a creamier risotto. When adding your rice to your stock, be sure to fully coat it with the mixture for an even distribution of flavors. Throughout, keep stirring - you don't want your risotto to stick. ‰Û¬‰Û¬When frying your breaded arancini, be careful not to crowed them into the pan. This would lower the oil temperature, leading to imperfect results. ‰Û¬‰Û¬Not ready to serve immediately? Then keep your arancinis in a 300F oven to keep them warm and crisp.","video_length":1426,"videoname":"v206","techniques":"saute, fry","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id203"},{"id":204,"title":"Microwave Genoise with CrÌ¬me Anglaise & Espresso Syrup","description":"A genoise is a light, airy cake that makes a great sweet hors d'oeuvre. It bakes in the microwave, which is perfect if you're in a pinch. ‰Û¬‰Û¬This is actually a kind of sponge cake, which makes it ideal for topping in imaginative ways. For this recipe, you'll cook the batter in a paper coffee cup inside the microwave for 30-45 seconds. Flip the finished cake out of the cup, top and serve.","video_length":814,"videoname":"v207","techniques":"bake","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id204"},{"id":205,"title":"Swedish Meatballs with Blackcurrant Sauce","description":"Here's a classic hors d'oeuvre with an elegant twist: blackcurrant sauce. A few helpful hints: ‰Û¬‰Û¬When you're sweating your onions for the basis of your sauce, make sure they're finely chopped. Coarser chopping won't yield the same subtlety of flavor. In this recipe, we've enhanced the flavors with a surprising ingredient: root beer. ‰Û¬‰Û¬For your meatballs, consider combining some pork to the beef. The added fat will really intensify the flavor.","video_length":953,"videoname":"v208","techniques":"saute, braise","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id205"},{"id":206,"title":"Oysters with Cocktail Sauce Sorbet","description":"For this recipe, we're using West Coast Oysters - you can identify them by their more ruffled shells. ‰Û¬‰Û¬Remember, your cocktail sauce will look a little thin when you're first mixing the ingredients. Don't worry - this is normal. Just put the mixture into your stand-mixer and chill with dry ice. Voila - sorbet.","video_length":503,"videoname":"v209","techniques":"raw","difficulty":"moderate","lesson_length":"short","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id206"},{"id":207,"title":"Pan Roasted Rabbit with Carrot Puree and Red Wine","description":"This entree is dramatic - especially with the bright carrot puree. ‰Û¬‰Û¬Don't be intimidated by rabbit. It's actually quite similar to chicken in how you cook it. In this recipe, we braise the legs and sear the loins inside prosciutto. ‰Û¬‰Û¬For rabbit, be aggressive with your seasoning - especially with braising. This is one of the main differences between restaurant cooking and home cooking...in the home, most people are afraid to season effectively.","video_length":1263,"videoname":"v210","techniques":"saute, roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id207"},{"id":208,"title":"Breakfast For Dinner‰Û? Bacon Ice Cream","description":"This recipe for bacon ice cream combines both breakfast and dessert. It's a playful, delicious part of an interesting entree. ‰Û¬‰Û¬Instead of pre-sliced bacon, we suggest slab bacon. When you're combining your cream and sugar and bacon over heat, look for a creamier, less-white color. That's when you'll know the flavors have begun to properly infuse. ‰Û¬‰Û¬This is an adventurous collection of dishes that combines familiar flavors in interesting ways.","video_length":1431,"videoname":"v211","techniques":"saute","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id208"},{"id":209,"title":"Bouillabaisse (or is that \"Bouilla-BLAISE\")","description":"Bouillabaisse is a traditional dish from the South of France. Here, we're creating a little more whimsy and creativity. ‰Û¬‰Û¬Some ingredients are essential to bouillabaisse - saffron, fennel, tomato and others. Don't be afraid to season generously, and take the time to build flavors (as with all one-pot meals).","video_length":1437,"videoname":"v212","techniques":"braise, stew","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id209"},{"id":210,"title":"Miso-Glazed Sea Bass with Baby Bok Choy Hearts","description":"This is a great dish for entertaining because it can be prepped ahead of time. When you and your guests are hungry, just pop it in the oven. ‰Û¬‰Û¬We use Chilean Sea Bass because of its slightly sweet flavor - the perfect counterpoint to the miso. Speaking of miso, look for fermented soybean paste, not sweet miso (also called \"saikyo\"). And be careful not to salt your marinade - the soy sauce will provide any of that. ‰Û¬‰Û¬For the pickled bok choy, we've used the baby variety. That's because full-grown bok choy can get a little bitter.","video_length":716,"videoname":"v213","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id210"},{"id":211,"title":"Roasted Beet Salad with Carbonated Fruit","description":"This is a beet, goat cheese and orange salad - with a special fizzy twist. ‰Û¬‰Û¬It all starts with a tasty vinaigrette. Ours includes some exciting, bright flavors, including fish sauce, honey and grapefruit juice (among others). Remember, your vinaigrette can be made well ahead of time and used in a variety of dishes. ‰Û¬‰Û¬We prepped our beets by boiling them with the skins on. Differing greens (watercress, fennel greens, basil leaves, and others) will provide an interesting counterpoint to the natural sweetness of the beets. ‰Û¬‰Û¬The star of this salad is the carbonated oranges and raspberries by placing them in a canister charged with CO2. By the way - you can use these carbonated fruits in cocktails as well. ‰Û¬‰Û¬Your beets salad and carbonated fruit will top a thick slice of seared goat cheese for a creative combination of flavors, textures and temperatures.","video_length":944,"videoname":"v214","techniques":"roast","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":19,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id211"},{"id":212,"title":"Introduction to Sous Vide","description":"Literally translated from the French, \"sous vide\" means \"under vacuum.\" This way of cooking was pioneered in the 1960s by the airlines as a way to prepare food at high altitudes. ‰Û¬‰Û¬You need a sous vide machine and a vacuum packing machine to make sous vide. Anything can be cooked with this method - veggies, fruits, and virtually any meat, poultry or fish. ‰Û¬‰Û¬For sous vide, you'll generally use a lighter hand with your seasonings. It's a very precise method of cooking, so temperature and time are all very important.","video_length":448,"videoname":"v215","techniques":"technique","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id212"},{"id":213,"title":"Sous Vide Scrambled Eggs","description":"Sous Vide Scrambled Eggs are a unique way to create this classic. All it takes is eggs, white pepper, white truffle oil, heavy cream and salt mixed and placed in a plastic food-safe bag. Set the sous vide machine at 75 degrees C, and massage the eggs at the halfway point to get the right texture. ‰Û¬‰Û¬The sous vide alternative replicates the traditional method of French scrambled eggs - without the trouble of a double-boiler. The result is a silky, smooth scrambled egg.","video_length":352,"videoname":"v216","techniques":"technique","difficulty":"moderate","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id213"},{"id":214,"title":"Crab Cakes with Smoked Mayonnaise and Brussels Sprout","description":"This is a re-imagined classic, served up with a lightly smoked mayonnaise. ‰Û¬‰Û¬We use Alaskan King Crab, but any kind of crab is okay - so long as it's fresh. Remember to let your sweated vegetables cool before adding them to the crab. One other hint: be aggressive with the herbs, but show restraint with bread crumbs. You don't want your crab cake to seem like stuffing. ‰Û¬‰Û¬For the accompanying kraut, blanched Brussels sprouts, tart apples, chives, tarragon and parsley combine for a fresh, bright flavor. ‰Û¬‰Û¬Smoking mayonnaise requires a hand smoker. Trap the hickory smoke with a bowl inverted on top of your container of mayonnaise.","video_length":956,"videoname":"v217","techniques":"saute","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id214"},{"id":215,"title":"Sous Vide - Strip Steaks with Shallots & Watercress","description":"This modern technique begins traditionally enough - by seasoning your steak. Remember, a lighter hand is okay for sous vide cooking. ‰Û¬‰Û¬Here, we're using sous vide as a conduit for other cooking methods. Thus, the steak is started in the sous vide machine but finished by searing in the pan. Just make sure it's nice and dry when you do. ‰Û¬‰Û¬This steak is complemented by a rich red wine sauce and a light watercress salad with blue cheese crumbles. Remember to season the exposed portions of your slices for extra flavor.","video_length":932,"videoname":"v218","techniques":"saute","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id215"},{"id":216,"title":"Sous Vide - Salmon & Passion Fruit Sauce","description":"For sous vide salmon, the process begins by soaking your fish in brine. This is a great way to season the fish - and to keep it from releasing albumin (the white, gooey stuff) while it cooks. ‰Û¬‰Û¬The sous vide method enables you to infuse flavors deeper into the fish. The result is a more delicate, flaky, flavorful fish - with the added tang of passionfruit buerre blanc.","video_length":648,"videoname":"v219","techniques":"saute","difficulty":"easy","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id216"},{"id":217,"title":"Gelification - Butternut Squash Cannelloni \"Pasta\"","description":"The technique of gelification enables you to create some interesting dishes - such as a cannelloni pasta that's made out of butternut squash. ‰Û¬‰Û¬If you're not into butternut squash, you can use almost any creamy soup as the base for your gel. ‰Û¬‰Û¬This kind of pasta is 100% vegetarian and gluten-free.","video_length":758,"videoname":"v220","techniques":"saute","difficulty":"difficult","lesson_length":"long","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id217"},{"id":218,"title":"Airs & Foams - Parmesan Air, Potato Foam","description":"Foams are fairly simple to make at home. Start with boiled potatoes passed through a sieve. Mix ingredients together over heat, and when it reaches a soupy consistency (or just a little looser), let cool for a moment and place inside a whipped cream canister. Charge your canister with nitrous oxide and dispense your foam on the bottom of an upturned glass bowl. It should look somewhat like shaving cream. ‰Û¬‰Û¬For an air, start with a very tall stock pot. Add ingredients and blend with an immersion blender. Let it rest, then scoop the bubbly mixture away. When you do, it should sound like a bubble bath.","video_length":1115,"videoname":"v221","techniques":"steam, boil","difficulty":"moderate","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id218"},{"id":219,"title":"Reverse Spherification - Passionfruit \"Ravioli\"","description":"Precision is key when it comes to reverse spherification. For instance, some measurements are so precise they're measured to a tenth of a gram. ‰Û¬‰Û¬Though we use an immersion blender in this recipe, you can use a standard bar blender if that's all you have. You can also make your sodium alganate bath in advance - up to a week ahead of time if you choose. ‰Û¬‰Û¬The heart of this recipe is the chemical reaction between the alganate and the passion fruit/yogurt mixture. During this reaction, the yogurt liquid forms a gel around itself, thus changing the liquid into a solid.","video_length":681,"videoname":"v222","techniques":"technique","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id219"},{"id":220,"title":"Spherification - Canteloupe \"Caviar\"","description":"In this recipe, we use the technique of spherification to make our own caviar - out of cantaloupe. ‰Û¬‰Û¬Though we've used a popular melon in this recipe, remember that you can use these same techniques for a variety of different self-made caviars.","video_length":690,"videoname":"v223","techniques":"technique","difficulty":"difficult","lesson_length":"medium","notes":"","favorite":0,"mastered":0,"course_id":20,"chef_id":11,"iap_id":"com.topchefu.iap.lesson.id220"}]
